[
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/middlefield-original-cheese-co-op-recalls-organic-gouda-colored-cheddar-mozzarellaprovolone-pepper",
    "alert_date": "2025-09-08",
    "recalling_firm": "Middlefield Original Cheese Co-op",
    "brand_name": "Middlefield Original Cheese Co-op, Sunrise Creamery",
    "product_description": "Cheese",
    "product_title": "Middlefield Original Cheese Co-Op Recalls Organic Gouda, Colored Cheddar, Mozzarella/Provolone, Pepper Jack, Swiss, Dilly Pickle Cheese and Monterey Jack Due to Possible Listeria Monocytogenes Contamination",
    "reason_for_recall": "Potential contamination with-Listeria monocytogenes",
    "affected_states": [
      "Minnesota",
      "Ohio",
      "Texas",
      "Wisconsin"
    ],
    "distribution_pattern": "The recalled products were produced on May 30th, 2025 and August 13th, 2025 and distributed in Ohio, Minnesota, Wisconsin and Texas between July 7, 2025 and August 14, 2025. Products were sold through distributors, dining halls, and retail stores.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Middlefield, OH 9/5/25 - The Middlefield Original Cheese Co-Op facility in Middlefield, OH is recalling one lot of Sunrise Creamery Dilly Pickle Monterey Jack Cheese with Dill Pickles in 6 oz. and 1.25 lb. packages, one lot of Organic Gouda Cheese in 8 oz. packages, and specific lots of Mozzarella/Provolone Cheese, Cheddar Cheese, Pepper Jack Cheese, Swiss Cheese, and Monterey Jack Cheese packaged as 5 lb. loaves or 5 lb. shredded bags because of potential contamination with Listeria monocytogenes, an organism which can cause serious and sometimes fatal infections in young children, frail or elderly people, and others with weakened immune systems. Although healthy individuals may suffer only short-term symptoms such as high fever, severe headache, stiffness, nausea, abdominal pain and diarrhea, Listeria infection can cause miscarriages and stillbirths among pregnant women.",
      "The recalled products were produced on May 30th, 2025 and August 13th, 2025 and distributed in Ohio, Minnesota, Wisconsin and Texas between July 7, 2025 and August 14, 2025. Products were sold through distributors, dining halls, and retail stores.",
      "The recall affects the following products and specific lot codes/sell by dates only:",
      "Customers can find the lot code and sell by date for Sunrise Creamery products on the side of each individual package.",
      "Sell by dates for Middlefield Original Cheese Co-op products can be found on stickers located on each 5 lb. loaf or the box for 5 lb. bags of shredded cheeses.",
      "The recall was initiated after testing by the company revealed the presence of Listeria monocytogenes in finished product and on surfaces of cutting equipment. There have been no reports of illness to date associated with consumption of these products.",
      "Any customers with this product in their possession should dispose of it or return it to the retail location during normal business hours for a refund. Consumers or media with questions about the recall may contact the Middlefield Original Cheese Co-Op General Manager, Nevin Byler, at 440-632-5567 Monday through Friday 8 AM to 4 PM EST.",
      "Link to Original Press Release"
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/endico-potatoes-inc-recalls-25lb-bags-frozen-peas-and-carrots-and-mixed-vegetables-because-possible",
    "alert_date": "2025-09-04",
    "recalling_firm": "Endico Potatoes Inc.",
    "brand_name": "Endico",
    "product_description": "Frozen Peas and Carrots, Mixed Vegetables",
    "product_title": "Endico Potatoes Inc. Recalls 2.5lb Bags of Frozen “Peas And Carrots” and “Mixed Vegetables” Because of Possible Health Risk",
    "reason_for_recall": "Potential contamination with Listeria monocytogenes",
    "affected_states": [
      "Connecticut",
      "District of Columbia",
      "Florida",
      "Maryland",
      "New Jersey",
      "New York",
      "Pennsylvania"
    ],
    "distribution_pattern": "The recalled products were distributed to NY, NJ, PA, CT, MD, DC, FL through local distributors between 7/18/25 and 8/4/25.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "ENDICO POTATOES of MOUNT VERNON NY is recalling Endico brand PEAS AND CARROTS AND MIXED VEGETABLES, because they have the potential to be contaminated with Listeria monocytogenes, an organism which can cause serious and sometimes fatal infections in young children, frail or elderly people, and others with weakened immune systems. Although healthy individuals may suffer only short-term symptoms such as high fever, severe headache, stiffness, nausea, abdominal pain and diarrhea, Listeria infection can cause miscarriages and stillbirths among pregnant women.",
      "The recalled products were distributed to NY, NJ, PA, CT, MD, DC, FL through local distributors between 7/18/25 and 8/4/25.",
      "The product was packed in frozen 2.5lb clear plastic bags under the Endico label. The lot code of the affected product is",
      "These lot codes are printed on the side of the bag as shown below.",
      "No illnesses have been reported to date.",
      "The recall was the result of sampling done by the state of Pennsylvania at one of our distributors which revealed that the finished products tested positive for Listeria monocytogenes. The company has ceased distribution of the product as FDA and the company continue their investigation as to what caused the problem.",
      "Consumers who have purchased Endico brand peas and carrots or mixed vegetables with these lot codes are urged to not consume the products and to return them to the place of purchase for a full refund. Consumers with questions may contact the company at 1-800-431-1398."
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/ice-cream-factory-issues-allergy-alert-undeclared-almond-vanilla-gnutt-ice-cream",
    "alert_date": "2025-09-02",
    "recalling_firm": "Ice Cream Factory",
    "brand_name": "G.Nutt",
    "product_description": "Vanilla G.Nutt Ice Cream",
    "product_title": "Ice Cream Factory Issues Allergy Alert on Undeclared Almond in Vanilla G.Nutt Ice Cream",
    "reason_for_recall": "Undeclared almond allergen",
    "affected_states": [
      "New York"
    ],
    "distribution_pattern": "Vanilla G.Nutt ice cream was distributed in New York State – Golden Krust retail stores in Mount Vernon and White Plains NY, Farm Country Supermarket in Queens NY through direct delivery.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Ice Cream Factory of Mount Vernon, NY is recalling 40 Pints, 8 Quarts and 3 Half Gallons of Vanilla G.Nutt ice cream, because it may contain undeclared almond. People who have an allergy or severe sensitivity to tree nuts run the risk of serious or life-threatening allergic reaction if they consume these products.",
      "Vanilla G.Nutt ice cream was distributed in New York State – Golden Krust retail stores in Mount Vernon and White Plains NY, Farm Country Supermarket in Queens NY through direct delivery.",
      "Vanilla G.Nutt ice cream is packaged in plastic pints and half gallons; and white paper coated quart containers. The pint UPC code is 8 56781 00361 3, the quart UPC code is 8 56781 00362 0 and the half gallon UPC code is 8 56781 00363 7. Expiration date is March 2027. This information is located on the back label of the container. See photos.",
      "No illnesses have been reported to date.",
      "The recall was initiated after an undeclared allergen was discovered. Subsequent investigation indicates the problem was caused by a temporary breakdown in the company's production and packaging processes.",
      "Consumers who have purchased ice cream from any of the locations listed above are urged to return it to the place of purchase for a full refund or another flavor. Consumers with questions may contact Rudy Guerrino at (914) 441-9598, Monday-Friday, 9am-5pm eastern standard time."
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/updated-release-southwind-foods-llc-recalls-frozen-shrimp-because-possible-health-risk",
    "alert_date": "2025-08-29",
    "recalling_firm": "Southwind Foods, LLC.",
    "brand_name": "Sand Bar/Arctic Shores/Best Yet/Great American/First Street",
    "product_description": "Frozen shrimp",
    "product_title": "Updated Release: Southwind Foods, LLC Recalls Frozen Shrimp Because of Possible Health Risk",
    "reason_for_recall": "Due to possible radionuclide (Cesium-137) contamination.",
    "affected_states": [
      "Alabama",
      "Arizona",
      "California",
      "Massachusetts",
      "Minnesota",
      "Pennsylvania",
      "Utah",
      "Virginia",
      "Washington"
    ],
    "distribution_pattern": "The bagged, frozen shrimp product was distributed between July 17 – August 8, 2025, to retailers, distributors, and wholesalers in the following states: Alabama, Arizona, California, Massachusetts, Minnesota, Pennsylvania, Utah, Virginia, and Washington.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Southwind Foods, LLC of Carson, California is voluntarily recalling a limited quantity of Frozen Shrimp, due to possible radionuclide (Cesium-137) contamination. Cs-137 is a man-made radioisotope of cesium. Traces of Cs-137 are widespread and can be present in the environment at background levels, and at higher levels in water or foods grown, raised, or produced in areas with environmental contamination. The primary health effect of concern following longer term, repeated low dose exposure (e.g., through consumption of contaminated food or water over time) is an elevated risk of cancer, resulting from damage to DNA within living cells of the body.",
      "The bagged, frozen shrimp product was distributed between July 17 – August 8, 2025, to retailers, distributors, and wholesalers in the following states: Alabama, Arizona, California, Massachusetts, Minnesota, Pennsylvania, Utah, Virginia, and Washington.",
      "The FDA is actively investigating reports of Cesium-137 (Cs-137) contamination in shipping containers and frozen shrimp products processed by PT. Bahari Makmur Sejati (doing business as BMS Foods) of Indonesia. No illnesses have been reported to date.",
      "Additional information is available at: https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts",
      "Consumers who have purchased the recalled frozen shrimp should not consume the product and should dispose of the product or return it to the place of purchase for a full refund. Consumers with questions may contact the company at 1-323-262-8222 Monday-Friday during normal business hours (8am-4pm Pacific Time).",
      "Link to Original Press Release",
      "Link to FDA Safety Alert"
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/hans-kissle-llc-issues-allergy-alert-undeclared-wheat-allergen-hans-kissle-red-potato-bliss-salad-0",
    "alert_date": "2025-08-29",
    "recalling_firm": "Hans Kissle",
    "brand_name": "Hans Kissle",
    "product_description": "Red Bliss Potato Salad",
    "product_title": "Hans Kissle LLC Issues Allergy Alert on Undeclared Wheat (Allergen) in Hans Kissle Red Potato Bliss Salad",
    "reason_for_recall": "Undeclared wheat",
    "affected_states": [
      "Connecticut",
      "Massachusetts",
      "New Jersey",
      "New York",
      "Rhode Island"
    ],
    "distribution_pattern": "The mislabeled product was distributed to Stop and Shop retail locations in the following states: MA, RI, CT, NJ, and NY and has the potential to still be in consumers’ refrigerators.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "A previous version of this press release was issued on 8/5/2025. This press release was updated to include the quantity of product affected, as well as a second use by date of the same product.",
      "Haverhill, MA — Hans Kissle is voluntarily recalling 120 units of Hans Kissle Red Potato Bliss Salad due to undeclared allergen (wheat). People who have an allergy or severe sensitivity to wheat run the risk of serious or life-threatening allergic reaction if they consume these products.",
      "The mislabeled product was distributed to Stop and Shop retail locations in the following states: MA, RI, CT, NJ, and NY and has the potential to still be in consumers’ refrigerators.",
      "The product comes in a 16-ounce, clear plastic container with a white lid, marked with UPC Code 036217673706 and Use By: 8/20/25 and Use By: 9/25/25, located on the top lid. The clear container is labeled as Hans Kissle Tri Color Twist Pasta Salad and the top label declares the product as Hans Kissle Red Bliss Potato Salad.",
      "The recall was initiated after it was discovered that 120 containers of Tricolor Twist Pasta Salad were mislabeled with the incorrect top label. While the front label correctly identifies the product, the top label misrepresents it as Red Bliss Potato Salad. The actual product contains wheat, which is not declared on the top label.",
      "To date, no illnesses or adverse reactions have been reported in connection with this issue.",
      "Consumers who purchased the affected product are urged to return them to the place of purchase for a full refund. For questions, contact Hans Kissle at 978-556-4500, Monday– Friday, 8:00am-5:00pm EST.",
      "Link to Original Press Release"
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/aquastar-usa-corp-recalls-cocktail-shrimp-6oz-because-possible-health-risk",
    "alert_date": "2025-08-28",
    "recalling_firm": "Aquastar Corp",
    "brand_name": "Aqua Star",
    "product_description": "Cocktail Shrimp",
    "product_title": "Aquastar (USA) Corp Recalls Cocktail Shrimp 6oz Because of Possible Health Risk",
    "reason_for_recall": "Potential Contaminant – cesium-137 (Cs-137)",
    "affected_states": [
      "Alabama",
      "Alaska",
      "Arkansas",
      "Colorado",
      "Georgia",
      "Idaho",
      "Illinois",
      "Indiana",
      "Iowa",
      "Kansas",
      "Kentucky",
      "Louisiana",
      "Michigan",
      "Minnesota",
      "Mississippi",
      "Missouri",
      "Montana",
      "Nebraska",
      "North Dakota",
      "Ohio",
      "Oklahoma",
      "Oregon",
      "South Dakota",
      "Tennessee",
      "Texas",
      "Washington",
      "Wisconsin"
    ],
    "distribution_pattern": "The affected Cocktail Shrimp 6oz was sold only in Walmart stores in AK, AL, AR, CO, GA, IA, ID, IL, IN, KS, KY, LA, MI, MN, MO, MS, MT, ND, NE, OH, OK, OR, SD, TN, TX, WA, and WI between July 31, 2025 and August 16, 2025. The product was sold in refrigerated condition and has a 12-day shelf life and with various Best if Use By dates.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "August 28, 2025, AquaStar (USA) Corp of Seattle, WA is recalling approximately 26,460 packages of Cocktail Shrimp 6oz (see photo), imported from Indonesia, because they may have been prepared, packed, or held under insanitary conditions whereby they may have become contaminated with cesium-137 (Cs-137).",
      "Cs-137 is a man-made radioisotope of cesium. Traces of Cs-137 are widespread and can be present in the environment at background levels, and at higher levels in water or foods grown, raised, or produced in areas with environmental contamination. The primary health effect of concern following longer term, repeated low dose exposure (e.g., through consumption of contaminated food or water over time) is an elevated risk of cancer, resulting from damage to DNA within living cells of the body.",
      "The affected Cocktail Shrimp 6oz was sold only in Walmart stores in AK, AL, AR, CO, GA, IA, ID, IL, IN, KS, KY, LA, MI, MN, MO, MS, MT, ND, NE, OH, OK, OR, SD, TN, TX, WA, and WI between July 31, 2025 and August 16, 2025. The product was sold in refrigerated condition and has a 12-day shelf life and with various Best if Use By dates.",
      "The affected Cocktail Shrimp 6oz is packaged in a clear plastic tray and has a red and white label. The recalled product has the UPC 19434612191 and the Lot Codes 10662 5106, 10662 5107, 10662 5124, and 10662 5125 at the bottom of plastic tray.",
      "No illnesses have been reported to date.",
      "This recall is being made with the knowledge of the U.S. Food and Drug Administration.",
      "Consumers who have purchased affected shrimps should not consume the product and should dispose of or return it to the place of purchase for a full refund.",
      "Consumers with questions may contact AquaStar at 1-800-331-3440 Monday-Friday, 8am-5 pm PST.",
      "Link to FDA Advisory"
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/aquastar-usa-corp-recalls-kroger-mercado-frozen-cooked-shrimp-because-possible-health-risk",
    "alert_date": "2025-08-28",
    "recalling_firm": "Aquastar Corp",
    "brand_name": "Kroger",
    "product_description": "Mercado Frozen Cooked Shrimp",
    "product_title": "Aquastar (USA) Corp Recalls Kroger Mercado Frozen Cooked Shrimp Because of Possible Health Risk",
    "reason_for_recall": "Potential Contaminant – cesium-137 (Cs-137)",
    "affected_states": [
      "Alabama",
      "Arkansas",
      "Georgia",
      "Illinois",
      "Indiana",
      "Kansas",
      "Kentucky",
      "Michigan",
      "Mississippi",
      "Missouri",
      "Nebraska",
      "Ohio",
      "South Carolina",
      "Tennessee",
      "Virginia",
      "West Virginia",
      "Wisconsin"
    ],
    "distribution_pattern": "The affected shrimp was sold at Baker’s, Gerbes, Jay C, Kroger, Mariano’s, Metro Market, Pay Less Supermarkets, and Pick ‘n Save in AL, AR, GA, IL, IN, KS, KY, MI, MO, MS, NE, OH, SC, TN, VA, WI, WV between July 24, 2025 and August 11, 2025.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "August 27, 2025, AquaStar (USA) Corp of Seattle, WA is recalling approximately 18,000 bags (net wt. 2lbs) of Kroger Mercado Cooked Medium Peeled Tail-Off Shrimp because they may have been prepared, packed, or held under insanitary conditions whereby they may have become contaminated with cesium-137 (Cs-137).",
      "Cs-137 is a man-made radioisotope of cesium. Traces of Cs-137 are widespread and can be present in the environment at background levels, and at higher levels in water or foods grown, raised, or produced in areas with environmental contamination. The primary health effect of concern following longer term, repeated low dose exposure (e.g., through consumption of contaminated food or water over time) is an elevated risk of cancer, resulting from damage to DNA within living cells of the body.",
      "The affected shrimp was sold at Baker’s, Gerbes, Jay C, Kroger, Mariano’s, Metro Market, Pay Less Supermarkets, and Pick ‘n Save in AL, AR, GA, IL, IN, KS, KY, MI, MO, MS, NE, OH, SC, TN, VA, WI, WV between July 24, 2025 and August 11, 2025.",
      "The recalled Kroger Mercado Cooked Medium Peeled Tail-Off Shrimp, net wt. 2lbs., is packaged in clear plastic bag and has a white label with green stripes on top of each bag and has the following codes:",
      "The FDA is actively investigating reports of Cesium-137 (Cs-137) contamination in shipping containers and frozen shrimp products processed by PT. Bahari Makmur Sejati (doing business as BMS Foods) of Indonesia. No illnesses have been reported to date. As noted in the FDA statement issued on 8/19/25: “At this time, no product that has tested positive or alerted for Cesium-137 (Cs-137) has entered the U.S. commerce.”",
      "“FDA is working with distributors and retailers that received product from PT. Bahari Makmur Sejati after the date of first detection of Cs-137 by Customs & Border Protection (CBP), but from shipments that did not alert for Cs-137, to recommend that firms conduct a recall. In conjunction with other information, FDA determined that product from PT. Bahari Makmur Sejati violates the Federal Food, Drug, & Cosmetic Act in that it appears to have been prepared, packed, or held under insanitary conditions whereby it may have become contaminated with Cs-137 and may pose a safety concern.”",
      "Consumers who have purchased affected shrimps should not consume the product and should dispose of or return it to the place of purchase for a full refund.",
      "Consumers with questions may contact the company at 1-800-331-3440, Monday-Friday, 8am-5 pm PST.",
      "This recall is being made with the knowledge of the U.S. Food and Drug Administration."
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/country-eggs-llc-recalls-large-brown-cage-free-sunshine-yolks-because-possible-health-risk",
    "alert_date": "2025-08-27",
    "recalling_firm": "Country Eggs, LLC",
    "brand_name": "Country Eggs, NIJIYA, GOLDEN YOLK",
    "product_description": "Large Brown Cage Free Eggs",
    "product_title": "Country Eggs, LLC Recalls Large Brown Cage Free “Sunshine Yolks” Because of Possible  Health Risk",
    "reason_for_recall": "Potential Foodborne Illness - Salmonella",
    "affected_states": [
      "California",
      "Nevada"
    ],
    "distribution_pattern": "The LARGE BROWN CAGE FREE SUNSHINE were distributed in California and Nevada. Product was delivered to grocery stores and food service distributors.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Country Eggs, LLC of Lucerne Valley, CA is recalling our LARGE BROWN CAGE FREE SUNSHINE YOLKS because it has the potential to be contaminated with Salmonella, an organism which can cause serious and sometimes fatal infections in young children, frail or elderly people and others with weakened immune systems. Healthy persons infected with Salmonella often experience fever, diarrhea (which may be bloody), nausea, vomiting and abdominal pain. in rare circumstances, infection with Salmonella can result in the organism getting into the bloodstream and producing more severe illnesses such as arterial infections ( ie.. infected aneurysms), endocarditis and arthritis.",
      "The LARGE BROWN CAGE FREE SUNSHINE were distributed in California and Nevada. Product was delivered to grocery stores and food service distributors.",
      "Product was packed in individual retail cartons bearing carton brand names:",
      "Nagatoshi Produce   Code Dates sell by: 7/1/25 through 9/18/25 No. CA 7695Misuho                      Code Dates sell by: 7/1/25 through 9/18/25 No. CA 7695Nijiya Markets           Code Dates sell by: 7/1/25 through 9/18/25 No. CA 7695",
      "Packed 1/15 DZ Bulk for Foodservice:",
      "Country Eggs LARGE BROWN SUNSHINE YOLKS   Code Dates sell by: 7/1/25 - 9/18/25",
      "It has been reported that there have been 92 instances of illness and no reported deaths in connection with this problem.",
      "The potential for contamination was noted after being brought to our attention by the FDA and other authorities that our product may contain the presence of Salmonella.",
      "Production of the product has been suspended while FDA and the company continue their investigation as to the source of the problem.",
      "This recall is being made with the knowledge of the US Food and Drug Administration.",
      "Consumers who have purchased any of the affected retail brand cartons or in bulk from their foodservice distributors are urged to return them to the place you purchased them for a full refund or to safely dispose of them. Consumers with questions may contact the company at 1 (800) 722-3447 8am to 5pm Monday through Friday Pacific Standard Time or by email at INFO@countryeggsllc.com.",
      "Ensuring the safety and quality of the eggs we supply to our customers is our responsibility and our focus each day. We know this is concerning, and supporting you through this process is our priority. We apologize for the disruption this situation creates in your business. We are committed to addressing this matter fully and to implementing all necessary corrective actions to ensure this does not happen again. Your trust in our team and our products is essential to our business, and we will continue to keep you updated as the situation evolves.",
      "Link to FDA Outbreak Advisory"
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/company-voluntarily-recalls-honey-balsamic-salad-kit-due-potential-undeclared-sesame-and-soy",
    "alert_date": "2025-08-26",
    "recalling_firm": "Taylor Fresh Foods",
    "brand_name": "Taylor Farms",
    "product_description": "Honey Balsamic Salad Kit",
    "product_title": "Company Voluntarily Recalls Honey Balsamic Salad Kit Due to Potential Undeclared Sesame and Soy",
    "reason_for_recall": "Undeclared Allergen – Sesame and Soy",
    "affected_states": [
      "Alabama",
      "Arizona",
      "California",
      "Colorado",
      "Delaware",
      "Florida",
      "Georgia",
      "Indiana",
      "Kansas",
      "Kentucky",
      "Louisiana",
      "Michigan",
      "Mississippi",
      "Missouri",
      "New Jersey",
      "New York",
      "Ohio",
      "Oregon",
      "Pennsylvania",
      "Tennessee",
      "Texas",
      "Utah",
      "Virginia",
      "Washington",
      "West Virginia"
    ],
    "distribution_pattern": "The Taylor Farms Honey Balsamic Salad Kit 6/8.3oz in scope of this recall was distributed in AL, AZ, CA, CO, DE, FL, GA, IN, KS, KY, LA, MI, MO, MS, NJ, NY, OH, OR, PA, TN, TX, UT, VA, WA and WV and has code dates starting with “TFRS” and “Best If Used By” date up to and including September 4, 2025. The product code can be found in the upper right-hand corner of the packaging.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Salinas, Calif., August 26, 2025 – In response to a recall initiated by Latitude 36 Foods, LLC., Taylor Fresh Foods is voluntarily recalling the Taylor Farms Honey Balsamic Salad Kit 6/8.3oz. because it may contain undeclared sesame and soy allergens. People who have an allergy or severe sensitivity to sesame and soy run the risk of serious or life-threatening allergic reaction if they consume these products.",
      "Master packs — individual packets of dressing and toppings supplied by Latitude 36 Foods and included in Taylor Farms salad kits — incorrectly included Asian Sesame Ginger dressing rather than the intended Honey Balsamic Vinaigrette dressing, leading to the possibility of undeclared sesame and soy allergens in some Taylor Farms Honey Balsamic Salad Kits.",
      "The Taylor Farms Honey Balsamic Salad Kit 6/8.3oz in scope of this recall was distributed in AL, AZ, CA, CO, DE, FL, GA, IN, KS, KY, LA, MI, MO, MS, NJ, NY, OH, OR, PA, TN, TX, UT, VA, WA and WV and has code dates starting with “TFRS” and “Best If Used By” date up to and including September 4, 2025. The product code can be found in the upper right-hand corner of the packaging.",
      "Consumers who have the recalled salad kit should discard it immediately and not consume it. Refunds are available at the location of purchase. There have been no illnesses reported to Taylor Farms in connection with the recalled product. This recall does not apply to any other Taylor Farms products or brands. Consumers with any questions may contact our customer care team at 855-455-0098 Monday through Friday from 8am-5pm PT."
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/viva-raw-issues-voluntary-recall-two-lots-dog-and-cat-foods-due-salmonella-and-listeria",
    "alert_date": "2025-08-25",
    "recalling_firm": "Viva Raw LLC.",
    "brand_name": "Viva",
    "product_description": "Ground Beef for Dogs and Ground Chicken for Dogs and Cats",
    "product_title": "Viva Raw Issues Voluntary Recall of Two Lots of Dog and Cat Foods Due to Salmonella and Listeria Monocytogenes Contamination",
    "reason_for_recall": "Salmonella and Listeria monocytogenes contamination",
    "affected_states": [
      "Nationwide"
    ],
    "distribution_pattern": "The products were distributed between July 2, 2025 and August 21, 2025 directly to consumers nationwide and to a small number of select retailers in NY, IL, SC, FL, KS, CA, and AZ. The product is distributed as frozen 1 lb. bricks in clear vacuum packaging and the lot number is printed on the top of the packaging. Please see the attached example of product labelsExternal Link Disclaimer.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "August 25, 2025 – Viva Raw LLC, Charlotte, NC is voluntarily recalling two lots of dog and cat foods due to contamination with Salmonella and Listeria monocytogenes. The recall is for Lot 21495 (Viva Ground Beef for Dogs; Viva Beef & Turkey for Puppies) and Lot 21975 (Viva Ground Chicken for Dogs; Viva Chunked Chicken for Dogs; Viva Chicken for Cats; Viva Pure Chicken).",
      "Salmonella and Listeria can affect animals eating the products and there is risk to humans from handling contaminated pet products, especially if they have not thoroughly washed their hands after having contact with the products or any surfaces exposed to these products.",
      "Healthy people infected with Salmonella or Listeria should monitor themselves for some or all of the following symptoms: nausea, vomiting, diarrhea or bloody diarrhea, abdominal cramping and fever. Rarely, Salmonella and Listeria can result in more serious ailments, including arterial infections, endocarditis, arthritis, muscle pain, eye irritation, and urinary tract symptoms. Consumers exhibiting these signs after having contact with this product should contact their healthcare providers. Pregnant women are especially susceptible to Listeria infection, which can result in miscarriage. The young, the elderly, and people with weak immune systems are more vulnerable to infection.",
      "Pets with Salmonella or Listeria infections may be lethargic and have diarrhea or bloody diarrhea, fever, and vomiting. Some pets will have only decreased appetite, fever, and abdominal pain. Infected but otherwise healthy pets can be carriers and infect other animals or humans. If your pet has consumed the recalled product and has these symptoms, please contact your veterinarian.",
      "The products were distributed between July 2, 2025 and August 21, 2025 directly to consumers nationwide and to a small number of select retailers in NY, IL, SC, FL, KS, CA, and AZ. The product is distributed as frozen 1 lb. bricks in clear vacuum packaging and the lot number is printed on the top of the packaging. Please see the attached example of product labelsExternal Link Disclaimer.",
      "The potential for contamination was identified after routine testing was conducted by the North Carolina Department of Agriculture. Only products from Lots 21495 and 21975 are affected. No illnesses in dogs, cats, or humans related to these lots have been reported to date.",
      "If you have products from Lot 21495 or Lot 21975, please contact Viva Raw at info@vivarawpets.com for a refund on any remaining product. You should then dispose of the food in a way that children, pets, and wildlife cannot access. Do not sell or donate the recalled products. Do not feed the recalled product to pets or any other animals. Wash and sanitize pet food bowls, cups, and storage containers. Always ensure you wash and sanitize your hands after handling recalled food or any utensils that come in contact with recalled food.",
      "If you have any questions, please email us at info@vivarawpets.com or call/text us at (919) 371-8882 between 9:00 am – 5:00 pm EST Monday to Friday."
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/beaver-street-fisheries-llc-recalls-great-value-frozen-raw-shrimp-because-possible-health-risk",
    "alert_date": "2025-08-22",
    "recalling_firm": "Beaver Street Fisheries, LLC",
    "brand_name": "Great Value",
    "product_description": "Frozen Raw Shrimp",
    "product_title": "Beaver Street Fisheries, LLC  Recalls Great Value Frozen Raw Shrimp Because of Possible Health Risk",
    "reason_for_recall": "Possible contamination with radionuclide (Cesium-137)",
    "affected_states": [
      "Alabama",
      "Arkansas",
      "Florida",
      "Georgia",
      "Kentucky",
      "Louisiana",
      "Mississippi",
      "Missouri",
      "Ohio",
      "Oklahoma",
      "Pennsylvania",
      "Texas",
      "West Virginia"
    ],
    "distribution_pattern": "The product was distributed in the states of AL, AR, FL, GA, KY, LA, MO, MS, OH, OK, PA, TX, and WV, and was available for consumer purchase in select Walmart retail stores in those states from 07/28/2025 to 08/07/2025.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Beaver Street Fisheries, LLC of Jacksonville, FL is voluntarily recalling a limited quantity of Great Value Frozen Raw Shrimp EZ-Peel & Deveined Tail-On 21-25 Per lb as a precautionary measure per the recommended action stated in an FDA advisory statement dated 08/19/25 regarding Cesium-137 (Cs-137). Cs-137 is a man-made radioisotope of cesium. Traces of Cs-137 are widespread and can be present in the environment at background levels, and at higher levels in water or foods grown, raised, or produced in areas with environmental contamination. The primary health effect of concern following longer term, repeated low dose exposure (e.g., through consumption of contaminated food or water over time) is an elevated risk of cancer, resulting from damage to DNA within living cells of the body.",
      "The product was distributed in the states of AL, AR, FL, GA, KY, LA, MO, MS, OH, OK, PA, TX, and WV, and was available for consumer purchase in select Walmart retail stores in those states from 07/28/2025 to 08/07/2025.",
      "No illnesses have been reported to date.",
      "As noted in the FDA statement issued on 8/19/25: “At this time, no product that has tested positive or alerted for Cesium-137 (Cs-137) has entered the U.S. commerce. FDA is working with distributors and retailers that received product from PT. Bahari Makmur Sejati after the date of first detection of Cs-137 by Customs & Border Protection (CBP), but from shipments that did not alert for Cs-137, to recommend that firms conduct a recall. In conjunction with other information, FDA determined that product from PT. Bahari Makmur Sejati violates the Federal Food, Drug, & Cosmetic Act in that it appears to have been prepared, packed, or held under insanitary conditions whereby it may have become contaminated with Cs-137 and may pose a safety concern.”",
      "Products Affected:",
      "Consumers who have purchased the recalled frozen shrimp should not consume the product and should dispose of the product or return it to the place of purchase for a full refund.",
      "For additional questions please reach out to customer service by phone +1-904-354-8533.",
      "Customer service hours are Monday – Friday, 8AM to 5PM EST.",
      "Link to FDA Safety Alert"
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/blue-bell-ice-cream-issues-allergy-alert-undeclared-almond-walnut-and-pecan-moo-llennium-crunch-ice",
    "alert_date": "2025-08-22",
    "recalling_firm": "Blue Bell Creameries, L.P.",
    "brand_name": "Blue Bell",
    "product_description": "Ice Cream",
    "product_title": "Blue Bell Ice Cream Issues Allergy Alert on Undeclared Almond, Walnut, and Pecan in Moo-llennium Crunch Ice Cream Packaged in a Chocolate Chip Cookie Dough Half Gallon Carton with a Moo-llennium Crunch Ice Cream Lid",
    "reason_for_recall": "Undeclared almond, walnut, and pecan",
    "affected_states": [
      "Alabama",
      "Arkansas",
      "Florida",
      "Georgia",
      "Illinois",
      "Indiana",
      "Kansas",
      "Kentucky",
      "Louisiana",
      "Mississippi",
      "Missouri",
      "New Mexico",
      "Oklahoma",
      "Tennessee",
      "Texas",
      "Virginia"
    ],
    "distribution_pattern": "The affected ice cream half gallons were distributed through retail outlets in Alabama, Arkansas, Florida Panhandle, Northwest Georgia, Southern Indiana, Southern Illinois, Kansas, Kentucky, Louisiana, Mississippi, Missouri, New Mexico, Oklahoma, Tennessee, Texas, and Southwest Virginia.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "BRENHAM, Texas, August 22, 2025 – Blue Bell Ice Cream is voluntarily recalling a limited quantity of Moo-llennium Crunch Ice Cream half gallon packaged in a Chocolate Chip Cookie Dough carton produced in its Brenham, Texas, plant because of undeclared almond, walnut, and pecan. The recalled product was mistakenly packaged in Chocolate Chip Cookie Dough ice cream cartons with a Moo-llennium Crunch lid. People who have an allergy or severe sensitivity to almonds, walnuts, and pecans run the risk of a serious or life-threatening allergic reaction if they consume these products.",
      "A Blue Bell employee discovered the incorrect packaging on two half gallons while restocking a retailer. No illnesses or adverse reactions have been reported to date. No other incorrect packaging has been discovered or reported to date.",
      "The half gallons can be identified as Moo-llennium Crunch Ice Cream packaged in a Chocolate Chip Cookie Dough half gallon carton with a Moo-llennium Crunch lid and with the following code located on the top of the half gallon lid: 061027524. An image of the affected product is included below.",
      "The affected ice cream half gallons were distributed through retail outlets in Alabama, Arkansas, Florida Panhandle, Northwest Georgia, Southern Indiana, Southern Illinois, Kansas, Kentucky, Louisiana, Mississippi, Missouri, New Mexico, Oklahoma, Tennessee, Texas, and Southwest Virginia.",
      "Consumers who have purchased these items can return them to the place of purchase for a full refund.",
      "For more information, consumers may call 979-836-7977, Monday – Friday 8 a.m. – 5 p.m. CST or email us at consumerrelations@bluebell.com.",
      "This recall is being made with the knowledge of the U.S. Food and Drug Administration."
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/southwind-foods-llc-recalls-frozen-shrimp-because-possible-health-risk",
    "alert_date": "2025-08-21",
    "recalling_firm": "Southwind Foods, LLC.",
    "brand_name": "Sand Bar/Arctic Shores/Best Yet/Great American/First Street",
    "product_description": "Frozen shrimp",
    "product_title": "Southwind Foods, LLC Recalls Frozen Shrimp Because of Possible Health Risk",
    "reason_for_recall": "Due to possible radionuclide (Cesium-137) contamination.",
    "affected_states": [
      "Alabama",
      "Arizona",
      "California",
      "Massachusetts",
      "Minnesota",
      "Pennsylvania",
      "Utah",
      "Virginia",
      "Washington"
    ],
    "distribution_pattern": "The bagged, frozen shrimp product was distributed between July 17 – August 8, 2025 to retailers, distributors, and wholesalers in the following states: Alabama, Arizona, California, Massachusetts, Minnesota, Pennsylvania, Utah, Virginia, and Washington state.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Southwind Foods, LLC of Carson, California is voluntarily recalling a limited quantity of Frozen Shrimp, due to possible radionuclide (Cesium-137) contamination. Cs-137 is a man-made radioisotope of cesium. Traces of Cs-137 are widespread and can be present in the environment at background levels, and at higher levels in water or foods grown, raised, or produced in areas with environmental contamination. The primary health effect of concern following longer term, repeated low dose exposure (e.g., through consumption of contaminated food or water over time) is an elevated risk of cancer, resulting from damage to DNA within living cells of the body.",
      "The bagged, frozen shrimp product was distributed between July 17 – August 8, 2025 to retailers, distributors, and wholesalers in the following states: Alabama, Arizona, California, Massachusetts, Minnesota, Pennsylvania, Utah, Virginia, and Washington state.",
      "Item Number",
      "Item Description",
      "FROZEN RAW SHRIMP 31/40 SAND BAR 2LB BAG",
      "011110641182",
      "FROZEN COOKED SHRIMP 31/40 BEST YET 1LB BAG",
      "042187002736",
      "FROZEN COOKED SHRIMP 31/40 BEST YET 1 LB BAG",
      "042187002736",
      "FROZEN COOKED SHRIMP 41/50 BESY YET 1LB BAG",
      "042187002743",
      "FROZEN LARGE COOKED SHRIMP 31/40 ARTIC SHORES 1LB BAG",
      "041130812392",
      "FROZEN SMALL COOKED SHRIMP 61/70 ARTIC SHORES 1LB BAG",
      "041130810497",
      "FROZEN SMALL COOKED SHRIMP 91/120 WHITE ARCTIC SHORES 12OZ BAG",
      "041130810411",
      "FROZEN COOKED SALAD SHRIMP 150-200 ARCTIC SHORES 6OZ BAG",
      "041130811685",
      "FROZEN RAW SHRIMP 16/20 GREAT AMERICAN 2LB BAG",
      "829944010612",
      "FROZEN RAW SHRIMP 16/20 FIRST STREET 2LB BAG",
      "041512179471",
      "FROZEN RAW SHRIMP 71/90 GREAT AMERICAN 2LB BAG",
      "829944010698",
      "FROZEN COOKED SHRIMP MEAT GREAT AMERICAN 1LB BAG",
      "829944092540",
      "FROZEN COOKED SHRIMP 41/60 GREAT AMERICAN 2LB BAG",
      "829944012173",
      "The FDA is actively investigating reports of Cesium-137 (Cs-137) contamination in shipping containers and frozen shrimp products processed by PT. Bahari Makmur Sejati (doing business as BMS Foods) of Indonesia. No illnesses have been reported to date.",
      "Consumers who have purchased the recall frozen shrimp should not consume the product and should dispose of the product or return it to the place of purchase for a full refund. Consumers with questions may contact the company at 1-323-262-8222 Monday-Friday during normal business hours (8am-4pm Pacific Time).",
      "Link to FDA Safety Alert",
      "Link to Updated Press Release"
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/middlefield-original-cheese-co-op-recalls-100-grass-fed-pepper-jack-cheese-and-horseradish-flavored",
    "alert_date": "2025-08-18",
    "recalling_firm": "Middlefield Original Cheese Co-op",
    "brand_name": "Middlefield Original Cheese Co-op/Copia Collective/Farmers Cheese",
    "product_description": "Cheese",
    "product_title": "Middlefield Original Cheese Co-Op Recalls 100% Grass-Fed Pepper Jack Cheese and Horseradish Flavored Cheese Due to Possible Listeria monocytogenes Contamination",
    "reason_for_recall": "Potential contamination with Listeria monocytogenes",
    "affected_states": [
      "Ohio"
    ],
    "distribution_pattern": "The recalled products were produced on June 16, 2025, June 24, 2025, and July 16th, and distributed in the state of Ohio between July 14, 2025 and August 7, 2025. Products were shipped to manufacturers and distributors, and sold in retail stores.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Middlefield, OH 8/15/25 - The Middlefield Original Cheese Co-Op facility in Middlefield, OH is recalling 246.5 Lbs. of 100% Grass-fed Pepper Jack Cheese, sold in 8 oz. packages, 5 lb. loaves and 40 lb. loaves, 2.5 Lbs. of Horseradish Flavored Cheese, sold in 8 oz. packages, 640 Lbs. of Monterey Jack Cheese sold in 8 oz. packages, 5 lb. loaves and 40 lb. loaves because of potential contamination with Listeria monocytogenes, an organism which can cause serious and sometimes fatal infections in young children, frail or elderly people, and others with weakened immune systems. Although healthy individuals may suffer only short-term symptoms such as high fever, severe headache, stiffness, nausea, abdominal pain and diarrhea, Listeria infection can cause miscarriages and stillbirths among pregnant women.",
      "The recalled products were produced on June 16, 2025, June 24, 2025, and July 16th, and distributed in the state of Ohio between July 14, 2025 and August 7, 2025. Products were shipped to manufacturers and distributors, and sold in retail stores.",
      "The packages subject to recall were sold with the following labels:",
      "Customers can find the lot codes on 8 oz. packets and 5 lb. loaves located on the side.",
      "Customers can find date codes on 40 Lb. loaves.",
      "The recall was initiated after product testing by the company revealed the presence of Listeria monocytogenes in the products. Production was suspended while the company investigated the source of the contamination which was determined to be from environmental contamination that migrated to food-contact areas of the production process. There have been no reports of illness to date associated with consumption of these products.",
      "Any customers with this product in their possession should dispose of it or return it to the retail location during normal business hours for a refund. Consumers or media with questions about the recall may contact the Middlefield Original Cheese Co-op General Manager, Nevin Byler, at 440-632-5567 Monday through Friday 8 AM to 4 PM EST.",
      "Link to Updated Press Release"
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/fromi-usa-recalls-brie-royal-faucon-1kg-because-possible-health-risk",
    "alert_date": "2025-08-14",
    "recalling_firm": "Fromi USA",
    "brand_name": "Brie Royal Faucon",
    "product_description": "Brie Royal Faucon Cheese",
    "product_title": "Fromi USA Recalls Brie Royal Faucon 1kg Because of Possible Health Risk",
    "reason_for_recall": "Potential contamination with Listeria monocytogenes",
    "affected_states": [
      "New York"
    ],
    "distribution_pattern": "The Brie Royal Faucon 1kg was distributed to Cheese Plate Park Slope LLC, located at 400 7th Avenue, 11215 Brooklyn NY. The recalled cheese was then cut and sold to customers from Cheese Plate Brooklyn - Park Slope LLC., and Cheese Plate Brooklyn : Carroll Gardens from 07/24/2025 through 08/13/2025.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "FROMI USA of New York, NY is recalling 12 Cases of Brie Royal Faucon 1kg, because they have the potential to be contaminated with Listeria monocytogenes, an organism which can cause serious and sometimes fatal infections in young children, frail or elderly people, and others with weakened immune systems. Although healthy individuals may suffer only short-term symptoms such as high fever, severe headache, stiffness, nausea, abdominal pain and diarrhea, Listeria infection can cause miscarriages and stillbirths among pregnant women.",
      "The Brie Royal Faucon 1kg was distributed to Cheese Plate Park Slope LLC, located at 400 7th Avenue, 11215 Brooklyn NY. The recalled cheese was then cut and sold to customers from Cheese Plate Brooklyn - Park Slope LLC., and Cheese Plate Brooklyn : Carroll Gardens from 07/24/2025 through 08/13/2025.",
      "The Brie Royal Faucon 1kg is made from pasteurized cow’s milk and is packed 2 units/case. Each cheese is placed in a wooden box. Brie Royal Faucon 1kg is a bulk product that can be sold either whole or cut into portions. Lot number:615 appears on both the wooden box of each cheese and the case.",
      "The recall was initiated after the foreign manufacturer of this cheese was notified by its health authorities of the potential contamination of some of its products with Listeria monocytogenes . No illnesses have been reported to date related to the consumption of this product within the United States.",
      "Consumers who have purchased The Brie Royal Faucon 1kg or cut portions are urged to return it to the place of purchase for a full refund.",
      "Consumers with questions may contact the company at: +1 212 583 4920 from 9 am to 5 pm EST Monday - Friday."
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/quesito-el-establo-retira-del-mercado-queso-quesito-colombiano-debido-posible-riesgo-para-la-salud",
    "alert_date": "2025-08-13",
    "recalling_firm": "Quesito El Establo",
    "brand_name": "Quesito El Establo",
    "product_description": "Spanish Cheese (Quesito Colombiano)",
    "product_title": "Quesito El Establo Retira Del Mercado Queso (Quesito Colombiano) Debido a Posible Riesgo Para La Salud",
    "reason_for_recall": "Due to the presence of rodent, rodent activity, and other insanitary conditions during the manufacturing and storage process",
    "affected_states": [
      "Nationwide"
    ],
    "distribution_pattern": "",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Quesito El Establo, de Salem, NH, está retirando del mercado todos sus productos de Queso Español (Quesito Colombiano) fabricados en sus instalaciones, debido a la presencia de roedores, actividad de roedores y otras condiciones insalubres durante el proceso de producción y almacenamiento.",
      "Existen numerosos riesgos asociados con los roedores, incluyendo la posible presencia de Salmonella. El uso o consumo de los productos afectados puede representar un riesgo de enfermedad debido a la posible presencia de Salmonella, un organismo que puede causar infecciones graves e incluso mortales en bebés, niños pequeños, personas frágiles o de edad avanzada, mujeres embarazadas, personas con patologías preexistentes (por ejemplo, pacientes con cáncer en tratamiento de quimioterapia, receptores de trasplante de órganos, etc.) y otras con sistemas inmunitarios debilitados.",
      "Las personas sanas infectadas con Salmonella suelen experimentar fiebre, diarrea (que puede ser con sangre), náuseas, vómitos y dolor abdominal. En casos poco frecuentes, la infección por Salmonella puede llegar al torrente sanguíneo y provocar enfermedades más graves, como infecciones arteriales (por ejemplo, aneurismas infectados), endocarditis y artritis.",
      "El Queso Español (Quesito Colombiano) fue distribuido en Massachusetts en tiendas minoristas dirigidas al público hispano/latino. Todos los productos con código AUG 22 2025 o anterior están incluidos en el retiro.",
      "El producto retirado del mercado está envuelto en plástico y colocado dentro de bolsas tipo Ziploc. Cada unidad pesa aproximadamente 1 libra y lleva una etiqueta azul con la imagen de una vaca en el centro y la leyenda “Quesito Colombiano” escrita en color amarillo debajo. En la parte superior de la etiqueta se indica “Spanish Cheese” y aparece “Quesito El Establo” como fabricante. Las fechas de vencimiento están impresas en la etiqueta.",
      "Hasta la fecha no se han reportado casos de enfermedades.",
      "Este retiro es el resultado de una inspección de la FDA en la que se observaron condiciones insalubres. Quesito El Establo ha detenido la producción y distribución del producto mientras la FDA y la empresa continúan con la investigación.",
      "Se exhorta a los consumidores que hayan comprado el producto retirado a no consumirlo y devolverlo al lugar de compra para obtener un reembolso completo. Los consumidores con preguntas pueden comunicarse con la empresa al 617-842-0513 (de lunes a sábado, de 9:00 a.m. a 5:00 p.m., hora del Este).",
      "Enlace a la traducción al inglés"
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/dollar-general-announces-voluntary-recall-clover-valleyr-instant-coffee-due-potential-presence-glass",
    "alert_date": "2025-08-12",
    "recalling_firm": "Dollar General Corporation",
    "brand_name": "Clover Valley",
    "product_description": "Instant coffee",
    "product_title": "Dollar General Announces Voluntary Recall of Clover Valley® Instant Coffee  Due to Potential Presence of Glass",
    "reason_for_recall": "Potential presence of glass",
    "affected_states": [
      "Alabama",
      "Arizona",
      "Arkansas",
      "California",
      "Colorado",
      "Connecticut",
      "Delaware",
      "Florida",
      "Georgia",
      "Idaho",
      "Illinois",
      "Indiana",
      "Iowa",
      "Kansas",
      "Kentucky",
      "Louisiana",
      "Maine",
      "Maryland",
      "Massachusetts",
      "Michigan",
      "Minnesota",
      "Mississippi",
      "Missouri",
      "Montana",
      "Nebraska",
      "Nevada",
      "New Hampshire",
      "New Jersey",
      "New Mexico",
      "New York",
      "North Carolina",
      "North Dakota",
      "Ohio",
      "Oklahoma",
      "Oregon",
      "Pennsylvania",
      "Rhode Island",
      "South Carolina",
      "South Dakota",
      "Tennessee",
      "Texas",
      "Utah",
      "Vermont",
      "Virginia",
      "Washington",
      "West Virginia",
      "Wisconsin",
      "Wyoming"
    ],
    "distribution_pattern": "Clover Valley® Instant Coffee was sold and distributed between July 9-21, 2025 exclusively in Dollar General retail stores located in the following states: AL, AR, AZ, CA, CO, CT, DE, FL, GA, IA,ID, IL, IN, KS, KY, LA, MA, MD, ME, MI, MN, MO, MS, MT, NC, ND, NE, NH, NJ, NM, NV, NY, OH, OK, OR, PA, RI, SC, SD, TN, TX, UT, VA, VT, WA, WI ,WV, and WY.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Goodlettsville, Tennessee – August 11, 2025 –Dollar General Corporation is recalling three (3) lots of its eight (8) ounce Clover Valley® Instant Coffee due to the potential presence of glass.",
      "8-Ounce Clover Valley® Instant CoffeePackage UPC: 876941004069Lot: L-5163 / Best By 12/13/2026Lot: L-5164 / Best by 12/13/2026Lot: L-5165 / Best by 12/14/2026Customers can find the lot and best by date information around the neck of the unit.",
      "Clover Valley® Instant Coffee was sold and distributed between July 9-21, 2025 exclusively in Dollar General retail stores located in the following states: AL, AR, AZ, CA, CO, CT, DE, FL, GA, IA,ID, IL, IN, KS, KY, LA, MA, MD, ME, MI, MN, MO, MS, MT, NC, ND, NE, NH, NJ, NM, NV, NY, OH, OK, OR, PA, RI, SC, SD, TN, TX, UT, VA, VT, WA, WI ,WV, and WY.",
      "The recall is being initiated after a customer notified Dollar General employees about the potential issue. Ingesting glass fragments may cause injury to the consumer, and these injuries may include damage to teeth, laceration of the mouth and throat, or perforation of the intestine. No illnesses or injuries have been reported to date.",
      "Customers who purchased this product are encouraged to discard it and contact Dollar General either via email at customercare@dollargeneral.com or by phone at 1-888-309-9030 from 6 a.m. to 1 a.m. CST seven days a week to request a full refund of the purchase price (including any tax).",
      "Dollar General is actively investigating the source of the glass contamination and apologizes for any inconvenience caused by this product issue. The recall is being conducted with the knowledge of the U.S. Food & Drug Administration (FDA).",
      "For additional information, please contact the Media Relations Department at dgpr@dg.com.",
      "About Dollar General Corporation Dollar General Corporation(NYSE: DG) is proud to serve as America’s neighborhood general store. Founded in 1939, Dollar General lives its mission of Serving Others every day by providing access to affordable products and services for its customers, career opportunities for its employees, and literacy and education support for its hometown communities. As of May 2, 2025, the Company’s 20,582 Dollar General, DG Market, DGX and pOpshelf stores across the United States and Mi Súper Dollar General stores in Mexico provide everyday essentials including food, health and wellness products, cleaning and laundry supplies, self-care and beauty items, and seasonal décor from our high-quality private brands alongside many of the world’s most trusted brands such as Coca Cola, PepsiCo/Frito-Lay, General Mills, Hershey, J.M. Smucker, Kraft, Mars, Nestlé, Procter & Gamble and Unilever."
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/wegmans-food-markets-inc-recalls-various-wegmans-camembert-soft-ripened-cheese-products-because",
    "alert_date": "2025-08-12",
    "recalling_firm": "Wegmans New York",
    "brand_name": "Wegmans",
    "product_description": "Cheeses",
    "product_title": "Wegmans Food Markets, Inc. Recalls Various Wegmans Camembert Soft Ripened Cheese Products Because of Possible Health Risk",
    "reason_for_recall": "Potential Foodborne Illness - Listeria monocytogenes",
    "affected_states": [
      "Connecticut",
      "Delaware",
      "District of Columbia",
      "Maryland",
      "Massachusetts",
      "New Jersey",
      "New York",
      "North Carolina",
      "Pennsylvania",
      "Virginia"
    ],
    "distribution_pattern": "The affected products were sold in the cheese department at all Wegmans stores located in Connecticut, Delaware, Maryland, Massachusetts, New Jersey, New York, North Carolina, Pennsylvania, Virginia, and Washington, D.C.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Rochester, N.Y. – Wegmans Food Markets, Inc. is recalling Wegmans Medium Camembert Soft Ripened Cheese, and various products containing this cheese, because it has the potential to be contaminated with Listeria monocytogenes, an organism which can cause serious and sometimes fatal infections in young children, frail or elderly people, and others with weakened immune systems. Although healthy individuals may suffer only short-term symptoms such as high fever, severe headache, stiffness, nausea, abdominal pain and diarrhea, Listeria infection can cause miscarriages and stillbirths among pregnant women.",
      "The affected products were sold in the cheese department at all Wegmans stores located in Connecticut, Delaware, Maryland, Massachusetts, New Jersey, New York, North Carolina, Pennsylvania, Virginia, and Washington, D.C.",
      "Affected items, sold between July 1 and August 12, 2025, include:",
      "The cheese was supplied to Wegmans by Estancia Holdings of Cumming, Georgia, who initiated a recall after the company was notified by their French supplier that three shipments they received may be contaminated with Listeria monocytogenes.",
      "No illnesses associated with this recall have been reported to Wegmans or its supplier, to date.",
      "Wegmans has placed automated phone calls to alert customers who purchased these products using Shoppers Club.",
      "Customers should not consume the products and return them to the service desk for a full refund. Those with questions may contact Wegmans Food Markets at 1-855-934-3663, available daily from 8:00 a.m. through 8:00 p.m. EST."
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/quesito-el-establo-recalls-spanish-cheese-quesito-colombiano-because-possible-health-risk",
    "alert_date": "2025-08-12",
    "recalling_firm": "Quesito El Establo",
    "brand_name": "Quesito El Establo",
    "product_description": "Spanish Cheese (Quesito Colombiano)",
    "product_title": "Quesito El Establo Recalls Spanish Cheese (Quesito Colombiano) Because of Possible Health Risk",
    "reason_for_recall": "Due to the presence of rodent, rodent activity, and other insanitary conditions during the manufacturing and storage process",
    "affected_states": [
      "Massachusetts"
    ],
    "distribution_pattern": "The Spanish Cheese (Quesito Colombiano) was distributed in Massachusetts in Hispanic/Latino retail stores. All products with stamped with code AUG 22 2025 or earlier are included in the recall.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Quesito El Establo of Salem, NH is recalling all Spanish Cheese (Quesito Colombiano) manufactured in their facility, due to the presence of rodent, rodent activity, and other insanitary conditions during the manufacturing and storage process.",
      "There are numerous hazards associated with rodents including the potential presence of Salmonella. Use or consumption of affected products may present risk of illness due to the potential presence of Salmonella, an organism which can cause serious and sometimes fatal infections in infants, young children, frail or elderly people, pregnant persons, persons with pre- existent pathology (e.g., patients with cancer undergoing chemotherapy treatments, organ transplant recipient, etc.) and others with weakened immune systems. Healthy persons infected with Salmonella often experience fever, diarrhea (which may be bloody), nausea, vomiting and abdominal pain. In rare circumstances, infection with Salmonella can result in the organism getting into the bloodstream and producing more severe illnesses such as arterial infections (i.e., infected aneurysms), endocarditis and arthritis.",
      "The Spanish Cheese (Quesito Colombiano) was distributed in Massachusetts in Hispanic/Latino retail stores. All products with stamped with code AUG 22 2025 or earlier are included in the recall.",
      "The recalled product is packaged wrapped in plastic and placed in Ziploc bags. Each unit is approximately 1 lb. and has a blue sticker featuring a cow in the center with “Quesito Colombiano” written in yellow below it. At the top of the label the product is indicated to be Spanish Cheese with Quesito El Establo listed as the manufacturer. Expiration dates are stamped on the label.",
      "No illnesses have been reported to date.",
      "This recall is the result of an FDA inspection where insanitary conditions were observed. Quesito el Establo has ceased the production and distribution of the product as FDA and the company continue their investigation.",
      "Consumers who have purchased the recalled product are urged not to consume it and to return it to the place of purchase for a full refund. Consumers with questions may contact the company at 617-842.0513 (Monday through Saturday, 9:00am – 5:00pm EST).",
      "Link to Spanish Translation"
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/neuhaus-issues-allergy-alert-undeclared-wheat-belgian-chocolate-moments-smurfs-popping-milk",
    "alert_date": "2025-08-10",
    "recalling_firm": "Neuhaus Chocolates NV",
    "brand_name": "Neuhaus",
    "product_description": "Belgian Chocolate Moments Smurfs Popping Milk Chocolates with Cookies",
    "product_title": "Neuhaus Issues Allergy Alert on Undeclared Wheat in Belgian Chocolate Moments Smurf’s Popping Milk Chocolates with Cookies'",
    "reason_for_recall": "Undeclared wheat allergen",
    "affected_states": [
      "District of Columbia",
      "Maryland",
      "New York",
      "Pennsylvania",
      "Virginia"
    ],
    "distribution_pattern": "The Belgian Chocolate Moments Smurf’s “Popping Milk Chocolates with Cookies” were distributed between 21/07/2025 and 04/08/2025 by Neuhaus stores in New York, Virginia, Maryland, Pennsylvania, Washington D.C. and via the Neuhaus webshop (https://www.neuhauschocolates.com/en_US/homeExternal Link Disclaimer).",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Neuhaus Chocolates NV of Vlezenbeek, BELGIUM has initiated a voluntary recall for : Belgian Chocolate Moments Smurfs 'Popping Milk Chocolates with Cookies, because it contains undeclared wheat. People who have an allergy or severe sensitivity to wheat run the risk of serious or life-threatening allergic reaction if they consume these products.",
      "The Belgian Chocolate Moments Smurf’s “Popping Milk Chocolates with Cookies” were distributed between 21/07/2025 and 04/08/2025 by Neuhaus stores in New York, Virginia, Maryland, Pennsylvania, Washington D.C. and via the Neuhaus webshop (https://www.neuhauschocolates.com/en_US/homeExternal Link Disclaimer).",
      "The product can be identified by the following lot numbers and best before date:",
      "Batch Number",
      "Best Before Date",
      "Given the recent release and the short sales period, only 150 units have been sold. No complaints or illnesses have been reported to date.",
      "The action was initiated after it was discovered during an internal check that product containing wheat was distributed in packaging that did not reveal the presence of wheat. Subsequent investigation indicates the problem was caused by an exceptional combination of circumstances in which the ERP (Enterprise Resource Planning) did not include the allergen on the packaging.",
      "If you are allergic or intolerant to wheat (gluten), do not consume this product and return it to the point of sale where this product was purchased.",
      "Consumers with questions may contact the company at:",
      "Customer Care Monday – Friday8 a.m. – 5 p.m. CEST (Central European Summer Time)Phone: +32 2 568 23 00 customercare@neuhaus.be"
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/friendlys-issues-allergy-alert-undeclared-soywheat-friendlys-cookies-cream-ice-cream",
    "alert_date": "2025-08-06",
    "recalling_firm": "DFA Dairy Brands, LLC",
    "brand_name": "Friendly’s",
    "product_description": "Cookies and Cream Ice Cream",
    "product_title": "Friendly’s Issues Allergy Alert on Undeclared Soy/Wheat in Friendly’s Cookies & Cream Ice Cream",
    "reason_for_recall": "Undeclared wheat and soy allergens",
    "affected_states": [
      "Maryland",
      "Pennsylvania",
      "Virginia"
    ],
    "distribution_pattern": "The recalled product was distributed through a single distribution center, UNFI, to retail stores in Maryland, Virginia, and Pennsylvania.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Friendly’s Ice Cream is voluntarily recalling a limited quantity (324 cartons) of 48 fl. oz. Cookies & Cream ice cream because of undeclared soy and wheat. The recalled product was mistakenly packaged in Friendly’s Vanilla Bean ice cream cartons with a Cookies & Cream lid. People who have an allergy or severe sensitivity to soy and/or wheat run the risk of a serious or life-threatening allergic reaction if they consume these products.",
      "The recalled product was distributed through a single distribution center, UNFI, to retail stores in Maryland, Virginia, and Pennsylvania.",
      "The recalled product is packaged in a 48 fl. oz. Friendly’s Vanilla Bean ice cream carton with a Friendly’s Cookies & Cream lid and a best by date of 11/26/25. The best by date can be found on the product lid. No other Friendly’s products are affected.",
      "The voluntary recall was initiated after it was discovered that a limited quantity of Cookies & Cream ice cream was mistakenly packaged in a Friendly’s Vanilla Bean ice cream cartons that did not identify the soy and wheat ingredients. No illnesses or adverse reactions have been reported.",
      "This recall is being made with the knowledge of the U.S. Food and Drug Administration.",
      "Consumers who have purchased 48 fl. oz. Friendly’s Vanilla Bean ice cream containers with a Cookies & Cream lid can return it to their place of purchase for a full refund.",
      "Consumers with questions may contact the company at 800-587-2259."
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/hans-kissle-llc-issues-allergy-alert-undeclared-wheat-allergen-hans-kissle-red-potato-bliss-salad",
    "alert_date": "2025-08-05",
    "recalling_firm": "Hans Kissle",
    "brand_name": "Hans Kissle",
    "product_description": "Red Bliss Potato Salad",
    "product_title": "Hans Kissle LLC Issues Allergy Alert on Undeclared Wheat (Allergen) in Hans Kissle Red Potato Bliss Salad",
    "reason_for_recall": "Undeclared wheat",
    "affected_states": [
      "Connecticut",
      "Massachusetts",
      "New Jersey",
      "New York",
      "Rhode Island"
    ],
    "distribution_pattern": "The mislabeled product was distributed to Stop and Shop retail locations in the following states: MA, RI, CT, NJ, and NY and has the potential to still be in consumers’ refrigerators.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Haverhill, MA — Hans Kissle is voluntarily recalling 66 units of Hans Kissle Red Potato Bliss Salad due to undeclared allergen (wheat). People who have an allergy or severe sensitivity to wheat run the risk of serious or life-threatening allergic reaction if they consume these products.",
      "The mislabeled product was distributed to Stop and Shop retail locations in the following states: MA, RI, CT, NJ, and NY and has the potential to still be in consumers’ refrigerators.",
      "The product comes in a 16-ounce, clear plastic container with a white lid, marked with UPC Code 036217673706 and Use By: 8/20/25, located on the top lid. The clear container is labeled as Hans Kissle Tri Color Twist Pasta Salad and the top label declares the product as Hans Kissle Red Bliss Potato Salad.",
      "The recall was initiated after it was discovered that 66 containers of Tricolor Twist Pasta Salad were mislabeled with the incorrect top label. While the front label correctly identifies the product, the top label misrepresents it as Red Bliss Potato Salad. The actual product contains wheat, which is not declared on the top label.",
      "To date, no illnesses or adverse reactions have been reported in connection with this issue.",
      "Consumers who purchased the affected product are urged to return them to the place of purchase for a full refund. For questions, contact Hans Kissle at 978-556-4500, Monday– Friday, 8:00am-5:00pm EST.",
      "Link to Updated Press Release"
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/doehler-dry-ingredient-solutions-llc-recalls-members-mark-freeze-dried-fruit-variety-pack-listeria",
    "alert_date": "2025-07-31",
    "recalling_firm": "Doehler Dry Ingredient Solutions, LLC",
    "brand_name": "Member’s Mark",
    "product_description": "Freeze dried fruit",
    "product_title": "Doehler Dry Ingredient Solutions, LLC Recalls Member’s Mark Freeze Dried Fruit Variety Pack for Listeria monocytogenes Contamination",
    "reason_for_recall": "Potential Foodborne Illness – Listeria monocytogenes",
    "affected_states": [
      "Alabama",
      "Arizona",
      "California",
      "Colorado",
      "Connecticut",
      "Delaware",
      "Florida",
      "Georgia",
      "Hawaii",
      "Idaho",
      "Illinois",
      "Indiana",
      "Iowa",
      "Kansas",
      "Louisiana",
      "Maine",
      "Maryland",
      "Michigan",
      "Minnesota",
      "Mississippi",
      "Missouri",
      "Montana",
      "Nebraska",
      "Nevada",
      "New Hampshire",
      "New Jersey",
      "New Mexico",
      "New York",
      "North Carolina",
      "North Dakota",
      "Ohio",
      "Oklahoma",
      "Pennsylvania",
      "South Carolina",
      "South Dakota",
      "Tennessee",
      "Texas",
      "Utah",
      "Virginia",
      "West Virginia",
      "Wisconsin",
      "Wyoming"
    ],
    "distribution_pattern": "The firm discovered the problem via internal testing of their products. The products were distributed between 7/1/2025-7/25/2025 and sold in Sam’s Club retail stores. These products were packaged in foil pouches inside a corrugated box. The lot number and expiration date are located on the bottom of the case. Product was shipped to distribution centers in the following states: AL, AZ, CA, CO, CT, DE, FL, GA, HI, IA, ID, IL, IN, KS, LA, MD, ME, MI, MN, MO, MS, MT, NC, ND, NE, NH, NJ, NM, NV, NY, OH, OK, PA, PR, SC, SD, TN, TX, UT, VA, WI, WV, WY. Consumers who have this product in their possession should not consume the product. They should discard it and may visit any Sam’s Club for a full refund.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Cartersville, GA – 7/30/2025 – Doehler Dry Ingredient Solutions, LLC is recalling Member’s Mark Freeze Dried Fruit Variety Pack 15 count boxes, UPC 1 93968 50900 2 due to contamination with Listeria monocytogenes. Listeria monocytogenes, an organism which can cause serious and sometimes fatal infections in young children, frail or elderly people, and others with weakened immune systems. Although healthy individuals may suffer only short-term symptoms such as high fever, severe headache, stiffness, nausea, abdominal pain and diarrhea, a Listeria monocytogenes infection can cause miscarriages and stillbirths among pregnant women.",
      "No illnesses have been reported to date.",
      "Products affected are:",
      "LOT/MFG CODES",
      "USE BY DATE",
      "Member’s MarkFreeze Dried FruitVariety Pack",
      "1 93968 50900 2",
      "Member’s MarkFreeze Dried FruitVariety Pack",
      "1 93968 50900 2",
      "Member’s MarkFreeze Dried FruitVariety Pack",
      "1 93968 50900 2",
      "Member’s MarkFreeze Dried FruitVariety Pack",
      "1 93968 50900 2",
      "Member’s MarkFreeze Dried FruitVariety Pack",
      "1 93968 50900 2",
      "Member’s MarkFreeze Dried FruitVariety Pack",
      "1 93968 50900 2",
      "Member’s MarkFreeze Dried FruitVariety Pack",
      "1 93968 50900 2",
      "Member’s MarkFreeze Dried FruitVariety Pack",
      "1 93968 50900 2",
      "Member’s MarkFreeze Dried FruitVariety Pack",
      "1 93968 50900 2",
      "Member’s MarkFreeze Dried FruitVariety Pack",
      "1 93968 50900 2",
      "Member’s MarkFreeze Dried FruitVariety Pack",
      "1 93968 50900 2",
      "Member’s MarkFreeze Dried FruitVariety Pack",
      "1 93968 50900 2",
      "Member’s MarkFreeze Dried FruitVariety Pack",
      "1 93968 50900 2",
      "Member’s MarkFreeze Dried FruitVariety Pack",
      "1 93968 50900 2",
      "Member’s MarkFreeze Dried FruitVariety Pack",
      "1 93968 50900 2",
      "Member’s MarkFreeze Dried FruitVariety Pack",
      "1 93968 50900 2",
      "Member’s MarkFreeze Dried FruitVariety Pack",
      "1 93968 50900 2",
      "Member’s MarkFreeze Dried FruitVariety Pack",
      "1 93968 50900 2",
      "Member’s MarkFreeze Dried FruitVariety Pack",
      "1 93968 50900 2",
      "Member’s MarkFreeze Dried FruitVariety Pack",
      "1 93968 50900 2",
      "Member’s MarkFreeze Dried FruitVariety Pack",
      "1 93968 50900 2",
      "Member’s MarkFreeze Dried FruitVariety Pack",
      "1 93968 50900 2",
      "The firm discovered the problem via internal testing of their products. The products were distributed between 7/1/2025-7/25/2025 and sold in Sam’s Club retail stores. These products were packaged in foil pouches inside a corrugated box. The lot number and expiration date are located on the bottom of the case. Product was shipped to distribution centers in the following states: AL, AZ, CA, CO, CT, DE, FL, GA, HI, IA, ID, IL, IN, KS, LA, MD, ME, MI, MN, MO, MS, MT, NC, ND, NE, NH, NJ, NM, NV, NY, OH, OK, PA, PR, SC, SD, TN, TX, UT, VA, WI, WV, WY. Consumers who have this product in their possession should not consume the product. They should discard it and may visit any Sam’s Club for a full refund.",
      "Consumers with questions may contact Doehler Dry Ingredient Solutions, LLC’s Customer Service at 770-387-0451, Monday-Friday 8am-5pm EST.",
      "This recall is being made with the knowledge of the Food and Drug Administration."
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/high-noon-announces-recall-its-vodka-seltzer-beach-pack-12-pack-due-inclusion-celsiusr-astro-vibe-tm",
    "alert_date": "2025-07-30",
    "recalling_firm": "High Noon",
    "brand_name": "High Noon, Celsius",
    "product_description": "Energy Drink",
    "product_title": "High Noon Announces Recall of its Vodka Seltzer Beach Pack (12 Pack) Due to Inclusion of CELSIUS® ASTRO VIBE ™ Energy Drink Cans that were Inadvertently Filled with Vodka Seltzer",
    "reason_for_recall": "Cans contain alcohol",
    "affected_states": [
      "Florida",
      "Michigan",
      "New York",
      "Ohio",
      "Oklahoma",
      "South Carolina",
      "Virginia",
      "Wisconsin"
    ],
    "distribution_pattern": "This recall is exclusively for the affected High Noon Beach Variety 12-packs with the lot codes listed above, which were shipped to distributors in FL, MI, NY, OH, OK, SC, VA & WI. Distributors shipped product to retailers in FL, NY, OH, SC, VA & WI. Product was shipped between July 21, 2025 – July 23, 2025.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "MODESTO, CA, July 29, 2025 – High Noon is recalling two production lots of High Noon Beach Variety packs (12-pack/12 fluid ounce cans). Some of these packs contain cans that are filled with High Noon vodka seltzer alcohol and are mislabeled as CELSIUS® ASTRO VIBE™ Energy Drink, Sparkling Blue Razz Edition with a silver top. Consumption of the liquid in these cans will result in unintentional alcohol ingestion.",
      "No illnesses or adverse events have been reported for this recall to date.",
      "Product Details: This labeling error is confined to the two lots listed below:",
      "Product Description",
      "Product Images",
      "High Noon BeachVariety Packs",
      "12 fluid ounce cans",
      "These productshave silver lids",
      "High Noon UPC:085000040065",
      "L CCC 17JL25 14:00 toL CCC 17JL25 23:59 L CCC 18JL25 00:00 toL CCC 18JL25 03:00  Lot Codes are on theexterior of the 12-pack.See below:",
      "See Image Below",
      "CELSIUS ASTROVIBE Energy Drink, Sparkling Blue Razz Edition",
      "12 fluid ounce cans",
      "The affectedCELSIUS canswill have a silverlid, instead of ablack lid.",
      "CELSIUS UPC8 89392 00134 1",
      "L CCB02JL25 2:55 to L CCB02JL25 3:11 The lot codes arelasered on thebottom of the can.",
      "See Image Below",
      "This recall is exclusively for the affected High Noon Beach Variety 12-packs with the lot codes listed above, which were shipped to distributors in FL, MI, NY, OH, OK, SC, VA & WI. Distributors shipped product to retailers in FL, NY, OH, SC, VA & WI. Product was shipped between July 21, 2025 – July 23, 2025.",
      "Even if not purchased in a High Noon Beach Variety pack, consumers should be advised to ensure their CELSIUS ASTRO VIBE Energy Drink, Sparkling Blue Razz Edition does not contain the lot codes (L CCB 02JL25 2:55 to L CCB 02JL25 3:11), prior to consuming.",
      "Consumers are advised to dispose of the CELSIUS ASTRO VIBE Energy Drink, Sparkling Blue Razz Edition cans with the impacted lot codes (L CCB 02JL25 2:55 to L CCB 02JL25 3:11) and not consume the liquid. High Noon Beach Variety packs with different lot codes than above are not affected by this recall and are safe to consume.",
      "The recall was initiated after High Noon discovered that a shared packaging supplier mistakenly shipped empty CELSIUS cans to High Noon.",
      "As a reminder, consumers are advised to dispose of the CELSIUS ASTRO VIBE Energy Drink, Sparkling Blue Razz Edition silver lid cans with the impacted lot codes (L CCB 02JL25 2:55 to L CCB 02JL25 3:11) and not consume the liquid.",
      "Consumers who have purchased the identified High Noon Beach Variety 12-packs or mislabeled CELSIUS ASTRO VIBE Energy Drink, Sparkling Blue Razz Edition (with lot codes: L CCB 02JL25 2:55 to L CCB 02JL25 3:11), should contact High Noon Consumer Relations at consumerrelations@highnoonvodka.com to get more information on next steps, including refunds.",
      "This recall is being conducted with the knowledge of the U.S. Food and Drug Administration and the Alcohol and Tobacco Tax and Trade Bureau."
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/albertsons-companies-stores-arkansas-louisiana-oklahoma-and-texas-voluntarily-expands-recall-select",
    "alert_date": "2025-07-28",
    "recalling_firm": "Albertsons",
    "brand_name": "Randalls, Albertsons, Tom Thumb",
    "product_description": "Additional Tuna Salad products",
    "product_title": "Albertsons Companies Stores in Arkansas, Louisiana, Oklahoma and Texas Voluntarily Expands Recall to Select Items Containing Tuna Salad from Reser’s Fine Foods Due to an Ingredient Recall Linked to Possible Listeria monocytogenes Contamination",
    "reason_for_recall": "Potential Foodborne Illness – Listeria monocytogenes",
    "affected_states": [
      "Arkansas",
      "Louisiana",
      "Oklahoma",
      "Texas"
    ],
    "distribution_pattern": "The items containing tuna salad were available for purchase at the following banner stores: Albertsons, Randalls and Tom Thumb in Arkansas, Louisiana, Oklahoma and Texas.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Albertsons, Randalls and Tom Thumb stores in Arkansas, Louisiana, Oklahoma and Texas are voluntarily recalling select items containing tuna salad supplied by Reser’s Fine Foods. This action follows a recall initiated by Reser’s Fine Food due to possible contamination with Listeria monocytogenes in breadcrumbs used as an ingredient in their tuna salad.",
      "Listeria monocytogenes is an organism which can cause serious and sometimes fatal infections in young children, frail or elderly people and others with weakened immune systems. Although healthy individuals may suffer only short-term symptoms such as high fever, severe headache, stiffness, nausea, abdominal pain and diarrhea, Listeria infection can cause miscarriages and stillbirths among pregnant women.",
      "Consumers who have purchased these items are urged not to consume these products and to dispose of them or return the items to their local store for a full refund. The FDA recommends in these cases that anyone who purchased or received any recalled products to use extra vigilance in cleaning and sanitizing any surfaces and containers that may have come in contact with these products to reduce the risk of cross-contamination. Listeria monocytogenes can survive in refrigerated temperatures and can easily spread to other foods and surfaces.",
      "There have been no reports of injuries or adverse reactions due to consumption of these products. Anyone concerned about an injury or illness should contact a healthcare provider.",
      "The items containing tuna salad were available for purchase at the following banner stores: Albertsons, Randalls and Tom Thumb in Arkansas, Louisiana, Oklahoma and Texas.",
      "Consumers with questions should contact Albertsons Companies’ Customer Service Center at 1-877-723-3929 Monday through Friday from 5 a.m. to 9 p.m. PST.",
      "Product Recall Details:",
      "Product Name",
      "Sell Thru Dates (if applicable, Or Lot Code/Est. Number)",
      "Store Banners",
      "RM DUO TUNA SALAD W/CRACKER S",
      "27183000000",
      "Jul 24 25 Thru Jul 29 25",
      "Albertsons, Randalls, Tom Thumb",
      "AR, LA, OK, TX",
      "RM SALAD TUNA PREMIUM SS",
      "21425000000",
      "Jul 24 25 Thru Jul 29 25",
      "Albertsons, Randalls, Tom Thumb",
      "AR, LA, OK, TX",
      "RM SNACKER TRAY TUNA SALAD",
      "21151300000",
      "Jul 24 25 Thru Jul 29 25",
      "Albertsons, Randalls, Tom Thumb",
      "AR, LA, OK, TX",
      "RM SNACKER TRAY TUNA SALAD",
      "21151300000",
      "JUL 24 25 Thru Jul 29 25",
      "Albertsons, Randalls, Tom Thumb",
      "AR, LA, OK, TX",
      "RM SNDWCH TUNA SALAD CROISSANT SS COLD",
      "21788400000",
      "Jul 23 25 Thru Jul 28 25",
      "Albertsons, Randalls, Tom Thumb",
      "AR, LA, OK, TX",
      "RM TUNA SALAD OVER BED OF LETTUCE SS",
      "21786400000",
      "Jul 23 25 Thru Jul 28 25",
      "Albertsons, Randalls, Tom Thumb",
      "AR, LA, OK, TX",
      "SALAD TUNA PREMIUM",
      "21228800000",
      "Variable Weight",
      "Jul 24 25 Thru Jul 29 25",
      "Albertsons, Randalls, Tom Thumb",
      "AR, LA, OK, TX",
      "TRAY CROISSANT MINI SALAD 16 IN",
      "27841300000",
      "Jul 23 25 Thru Jul 28 25",
      "Albertsons, Randalls, Tom Thumb",
      "AR, LA, OK, TX",
      "TRAY CROISSANT MINI SALAD 18 IN",
      "27841200000",
      "Jul 23 25 Thru Jul 28 25",
      "Albertsons, Randalls, Tom Thumb",
      "AR, LA, OK, TX",
      "TRAY SALAD SANDWICH 12 IN",
      "27841500000",
      "Jul 23 25 Thru Jul 28 25",
      "Albertsons, Randalls, Tom Thumb",
      "AR, LA, OK, TX",
      "TRAY SALAD SANDWICH 16 IN",
      "27841400000",
      "Jul 23 25 Thru Jul 28 25",
      "Albertsons, Randalls, Tom Thumb",
      "AR, LA, OK, TX",
      "Link to Initial Press Release"
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/hillside-orchard-farms-recalls-various-fruit-breads-fritters-due-undeclared-egg",
    "alert_date": "2025-07-28",
    "recalling_firm": "Hillside Orchard Farms",
    "brand_name": "Hillside Orchard Farms",
    "product_description": "Fruit Bread and Fritters",
    "product_title": "Hillside Orchard Farms Recalls Various Fruit Breads & Fritters Due to Undeclared Egg",
    "reason_for_recall": "Undeclared Allergen – Egg",
    "affected_states": [
      "Alabama",
      "Georgia",
      "North Carolina",
      "Pennsylvania",
      "South Carolina"
    ],
    "distribution_pattern": "The products were distributed between November 18, 2024 - July 16, 2025. These products were packaged in clear plastic and sold primarily in farm markets and roadside stands located in the States of: Alabama, Georgia, North Carolina, Pennsylvania, and South Carolina.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Tiger GA – July 28, 2025 – Hillside Orchard Farms is recalling various flavors of their 23oz Fruit Breads & 7.5 oz Fritters due to an undeclared allergen of Egg. People who have an allergy or severe sensitivity to egg run the risk of serious or life-threatening allergic reaction if they consume these products.",
      "On July 17, 2025, during an investigation by the FDA, the firm was made aware that the label failed to include the allergen egg had been left of the label during a reprint of the labels.",
      "No illnesses have been reported to date.",
      "Products affected are:",
      "LOT/MFGCODES",
      "USE BY DATE",
      "Apple Bread",
      "All dates through 07/23/2025",
      "Peach Bread",
      "All dates through 07/23/2025",
      "Strawberry Bread",
      "All dates through 07/23/2025",
      "Cinnamon Pecan Bread",
      "All dates through 07/23/2025",
      "Blueberry Bread",
      "All dates through 07/23/2025",
      "Blackberry Bread",
      "All dates through 07/23/2025",
      "Banana Nut Bread",
      "All dates through 07/23/2025",
      "Cheese Bread",
      "All dates through 07/23/2025",
      "Jalapeno Cheese Bread",
      "All dates through 07/23/2025",
      "Apple Fritters",
      "All dates through 07/23/2025",
      "Peach Fritters",
      "All dates through 07/23/2025",
      "Strawberry Fritters",
      "All dates through 07/23/2025",
      "Cinnamon Pecan Fritters",
      "All dates through 07/23/2025",
      "Blueberry Fritters",
      "All dates through 07/23/2025",
      "Blackberry Fritters",
      "All dates through 07/23/2025",
      "Recalled products can be identified from the attached photos.",
      "The products were distributed between November 18, 2024 - July 16, 2025. These products were packaged in clear plastic and sold primarily in farm markets and roadside stands located in the States of: Alabama, Georgia, North Carolina, Pennsylvania, and South Carolina.",
      "Consumers who have purchased these products are urged to return them to the place of purchase for a full refund or they may discard the product. Consumers with questions may contact Kiley Mitcham Houston, VP Operations Hillside Orchard Farms at 706-782-4995, Monday to Friday 8:30-5 EST.",
      "This recall is being made with the knowledge of the Food and Drug Administration."
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/tropicale-foods-recalls-certain-helados-mexico-and-la-michoacana-products-due-undeclared-milk",
    "alert_date": "2025-07-26",
    "recalling_firm": "Tropicale Foods",
    "brand_name": "La Michoacana, Helados Mexico",
    "product_description": "Ice cream products",
    "product_title": "Tropicale Foods Recalls Certain Helados Mexico and La Michoacana Products Due to  Undeclared Milk",
    "reason_for_recall": "Undeclared milk",
    "affected_states": [
      "Nationwide"
    ],
    "distribution_pattern": "Product was distributed at retail locations nationwide.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Tropicale Foods of Ontario, CA is recalling certain Helados Mexico and La Michoacana products with specific best by dates, as detailed below because these products contain undeclared milk. Though these products include “cream” in the product ingredient lists, the common name “milk” is not declared. People who have an allergy or severe sensitivity to milk run the risk of serious or life-threatening allergic reaction if they consume these products.",
      "Description",
      "Product was distributed at retail locations nationwide.",
      "Pictures of the recalled products are below.",
      "The company conducted an audit of all product labels, which led to this recall. One consumer illness has been reported to date.",
      "Consumers who have the affected product should dispose of and not consume this product if allergic or sensitive to milk. Consumers with questions may contact the company at 909-563-3090 between 8 am and 5 pm pacific, Monday to Friday."
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/ww-industrial-group-recalls-pear-slices-juice-due-elevated-levels-lead-and-cadmium",
    "alert_date": "2025-07-23",
    "recalling_firm": "WW Industrial Group",
    "brand_name": "Parashore",
    "product_description": "Canned Sliced Pears",
    "product_title": "W.W. Industrial Group Recalls Pear Slices in Juice Due to Elevated Levels of Lead and Cadmium",
    "reason_for_recall": "Potential Metal Contaminant – Lead and Cadmium",
    "affected_states": [
      "Nationwide"
    ],
    "distribution_pattern": "Product was distributed through Grocery Outlet stores in California and other Grocery Outlet stores across the US.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "W.W. Industrial Group, Inc., NY is recalling Parashore Pear Slices in juice, 15 oz, because they have the potential to be contaminated with elevated levels of lead and cadmium.",
      "Lead and cadmium are toxic substances present in our environment in small amounts and everyone is exposed to some of these heavy metals from daily actions such as inhaling dust, eating food, or drinking water. In general, the small exposure to lead within the U.S. population does not pose a significant public health concern.",
      "However, exposure to larger amounts of lead and cadmium can cause poisoning. While these heavy metals can affect nearly every bodily system, its effects depend upon the amount and duration of lead exposure and age. Symptoms can include abdominal pain, vomiting, lethargy, irritability, weakness, behavior or mood changes, delirium, seizures, and coma. However, infants, young children and the developing fetus can be affected by chronic exposure to amounts of heavy metals that may not result in obvious symptoms of lead poisoning. A child with heavy metal poisoning may not look or act sick. Heavy metal poisoning in children can cause: learning disabilities, developmental delays, and lower IQ scores.",
      "Product was distributed through Grocery Outlet stores in California and other Grocery Outlet stores across the US.",
      "The recalled product is packaged in a 15oz can and labeled as PARASHORE Pear Slices in Juice, 15oz (425 g), UPC#704817164237. The specific lot found positive for heavy metals was Lot 3700/01172 6122J, Prod: 02/19/2024, Best by 2/19/2027.",
      "No illnesses have been reported as of 07/22/2025.",
      "The heavy metal contamination was discovered via sampling by the Maryland Department of Health which is part of the FDA Laboratory Flexible Funding Model program.",
      "The company has recalled the products and is continuing an investigation to determine cause.",
      "Consumers who have purchased Parashore Pear Slices in Juice 15oz (425 g) should not consume the products and are urged to discard in the trash or return them to the place of purchase for a full refund. Consumers with questions may contact the company at 516-676-9188 Monday to Friday 10AM – 4PM EST.",
      "This recall is being made with the knowledge of the U.S. Food and Drug Administration."
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/jewel-osco-stores-illinois-indiana-and-iowa-voluntarily-recalls-select-items-containing-tuna-salad",
    "alert_date": "2025-07-21",
    "recalling_firm": "Jewel Osco",
    "brand_name": "Jewel Osco",
    "product_description": "Tuna Salad Products",
    "product_title": "Jewel Osco Stores in Illinois, Indiana and Iowa Voluntarily Recalls Select Items  Containing Tuna Salad from Reser’s Fine Foods Due to an Ingredient Recall Linked to  Possible Listeria Monocytogenes Contamination",
    "reason_for_recall": "Potential Foodborne Illness – Listeria monocytogenes",
    "affected_states": [
      "Illinois",
      "Indiana",
      "Iowa"
    ],
    "distribution_pattern": "The items containing tuna salad were available for purchase at Jewel Osco in Illinois, Indiana and Iowa.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Jewel Osco stores in Illinois, Indiana and Iowa are voluntarily recalling select items containing tuna salad supplied by Reser’s Fine Foods. This action follows a recall initiated by Reser’s Fine Food due to possible contamination with Listeria monocytogenes in breadcrumbs used as an ingredient in their tuna salad.",
      "Listeria monocytogenes is an organism which can cause serious and sometimes fatal infections in young children, frail or elderly people and others with weakened immune systems. Although healthy individuals may suffer only short-term symptoms such as high fever, severe headache, stiffness, nausea, abdominal pain and diarrhea, Listeria infection can cause miscarriages and stillbirths among pregnant women.",
      "Consumers who have purchased these items are urged not to consume these products and to dispose of them or return the items to their local store for a full refund. The FDA recommends in these cases that anyone who purchased or received any recalled products to use extra vigilance in cleaning and sanitizing any surfaces and containers that may have come in contact with these products to reduce the risk of cross-contamination. Listeria monocytogenes can survive in refrigerated temperatures and can easily spread to other foods and surfaces.",
      "There have been no reports of injuries or adverse reactions due to consumption of these products. Anyone concerned about an injury or illness should contact a healthcare provider.",
      "The items containing tuna salad were available for purchase at Jewel Osco in Illinois, Indiana and Iowa.",
      "Consumers with questions should contact Albertsons Companies’ Customer Service Center at 1-877-723-3929 Monday through Friday from 5 a.m. to 9 p.m. PST.",
      "Product Recall Details:",
      "Product Name",
      "Sell Thru Dates (if applicable, Or Lot Code/Est. Number)",
      "Store Banners",
      "CLUB SANDWICH ES WITH SALAD FS",
      "29125900000",
      "Jul 16 25 Thru Jul 18 25",
      "RM DUO TUNA SALAD W/CRACKER S",
      "27183000000",
      "Jul 17 25 Thru Jul 19 25",
      "RM QUAD TUNA SALAD",
      "21500300000",
      "Jul 17 25 Thru Jul 19 25",
      "RM SALAD TUNA SS /td>",
      "29486900000",
      "Jul 17 25 Thru Jul 19 25",
      "RM SNDWCH CROISSNT SSTBL TUNA SALAD SS",
      "21372500000",
      "Jul 17 25 Thru Jul 19 25",
      "RM SNDWCH TUNA SALAD CROISSANT SS COLD",
      "21788400000",
      "Jul 16 25 Thru Jul 18 25",
      "21680700000",
      "Variable Weight",
      "Jul 17 25 Thru Jul 19 25"
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/albertsons-companies-stores-arkansas-louisiana-oklahoma-and-texas-voluntarily-recalls-select-items",
    "alert_date": "2025-07-21",
    "recalling_firm": "Albertsons",
    "brand_name": "Randalls, Albertsons",
    "product_description": "Tuna Salad products",
    "product_title": "Albertsons Companies Stores in Arkansas, Louisiana, Oklahoma and Texas Voluntarily  Recalls Select Items Containing Tuna Salad from Reser’s Fine Foods Due to an  Ingredient Recall Linked to Possible Listeria Monocytogenes Contamination",
    "reason_for_recall": "Potential Foodborne Illness – Listeria monocytogenes",
    "affected_states": [
      "Arkansas",
      "Louisiana",
      "Oklahoma",
      "Texas"
    ],
    "distribution_pattern": "The items containing tuna salad were available for purchase at the following banner stores: Albertsons, Randalls and Tom Thumb in Arkansas, Louisiana, Oklahoma and Texas.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Albertsons, Randalls and Tom Thumb stores in Arkansas, Louisiana, Oklahoma and Texas are voluntarily recalling select items containing tuna salad supplied by Reser’s Fine Foods. This action follows a recall initiated by Reser’s Fine Food due to possible contamination with Listeria monocytogenes in breadcrumbs used as an ingredient in their tuna salad.",
      "Listeria monocytogenes is an organism which can cause serious and sometimes fatal infections in young children, frail or elderly people and others with weakened immune systems. Although healthy individuals may suffer only short-term symptoms such as high fever, severe headache, stiffness, nausea, abdominal pain and diarrhea, Listeria infection can cause miscarriages and stillbirths among pregnant women.",
      "Consumers who have purchased these items are urged not to consume these products and to dispose of them or return the items to their local store for a full refund. The FDA recommends in these cases that anyone who purchased or received any recalled products to use extra vigilance in cleaning and sanitizing any surfaces and containers that may have come in contact with these products to reduce the risk of cross-contamination. Listeria monocytogenes can survive in refrigerated temperatures and can easily spread to other foods and surfaces.",
      "There have been no reports of injuries or adverse reactions due to consumption of these products. Anyone concerned about an injury or illness should contact a healthcare provider.",
      "The items containing tuna salad were available for purchase at the following banner stores: Albertsons, Randalls and Tom Thumb in Arkansas, Louisiana, Oklahoma and Texas.",
      "Consumers with questions should contact Albertsons Companies’ Customer Service Center at 1-877-723-3929 Monday through Friday from 5 a.m. to 9 p.m. PST.",
      "Product Recall Details:",
      "Product Name",
      "Sell Thru Dates (if applicable, Or Lot Code/Est. Number)",
      "Store Banners",
      "RM DUO TUNA SALAD W/CRACKER S",
      "27183000000",
      "Jul 17 25 Thru Jul 19 25",
      "Albertsons, Randalls, Tom Thumb",
      "AR, LA, OK, TX",
      "RM SALAD TUNA PREMIUM SS",
      "21425000000",
      "Jul 17 25 Thru Jul 19 25",
      "Albertsons, Randalls, Tom Thumb",
      "AR, LA, OK, TX",
      "RM SNACKER TRAY TUNA SALAD",
      "21151300000",
      "Jul 17 25 Thru Jul 19 25",
      "Albertsons, Randalls, Tom Thumb",
      "AR, LA, OK, TX",
      "RM SNDWCH TUNA SALAD CROISSANT SS COLD",
      "21788400000",
      "Jul 16 25 Thru Jul 18 25",
      "Albertsons, Randalls, Tom Thumb",
      "AR, LA, OK, TX",
      "RM TUNA SALAD OVER BED OF LETTUCE SS",
      "21786400000",
      "Jul 16 25 Thru Jul 18 25",
      "Albertsons, Randalls, Tom Thumb",
      "AR, LA, OK, TX",
      "SALAD TUNA PREMIUM",
      "21228800000",
      "Variable Weight",
      "Jul 17 25 Thru Jul 19 25",
      "Albertsons, Randalls, Tom Thumb",
      "AR, LA, OK, TX",
      "TRAY CROISSANT MINI SALAD 16 IN",
      "27841300000",
      "Jul 16 25 Thru Jul 18 25",
      "Albertsons, Randalls, Tom Thumb",
      "AR, LA, OK, TX",
      "TRAY CROISSANT MINI SALAD 18 IN",
      "27841200000",
      "Jul 16 25 Thru Jul 18 25",
      "Albertsons, Randalls, Tom Thumb",
      "AR, LA, OK, TX",
      "TRAY SALAD SANDWICH 12 IN",
      "27841500000",
      "Jul 16 25 Thru Jul 18 25",
      "Albertsons, Randalls, Tom Thumb",
      "AR, LA, OK, TX",
      "TRAY SALAD SANDWICH 16 IN",
      "27841400000",
      "Jul 16 25 Thru Jul 18 25",
      "Albertsons, Randalls, Tom Thumb",
      "AR, LA, OK, TX",
      "Link to Expanded Recall"
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/nirwana-foods-issues-allergy-alert-undeclared-sulfites-golden-raisin-28oz-pouch-label",
    "alert_date": "2025-07-18",
    "recalling_firm": "Nirwana Foods LLC",
    "brand_name": "Nirwana Foods",
    "product_description": "Golden Raisins",
    "product_title": "Nirwana Foods Issues Allergy Alert on Undeclared Sulfites on Golden Raisin 28Oz Pouch Label",
    "reason_for_recall": "Undeclared sulfites",
    "affected_states": [
      "New Jersey",
      "New York"
    ],
    "distribution_pattern": "The recalled Golden Raisin was distributed at retail stores of Maharaja Super Market, NY and Villager Farmers Market stores located at NY and NJ.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Nirwana Foods of NJ is recalling its 28-ounce pouches Golden Raisin with lot number (24/351-2410) because they may contain undeclared sulfites. People who have allergies to sulfites run the risk of serious or life-threatening allergic reaction if they consume these products.",
      "The recalled Golden Raisin was distributed at retail stores of Maharaja Super Market, NY and Villager Farmers Market stores located at NY and NJ.",
      "The product comes in a 28-ounce pouch, clear plastic package marked with lot (24/351-2410) on the top and with an expiration date of Oct 31, 2025, stamped on the label. The product UPC code is 712321993144.",
      "No illnesses or allergic reactions involving this product have been reported to date.",
      "The recall was initiated after routine sampling by the New York State Department of Agriculture and Markets Food Inspectors and subsequent analysis by Food Laboratory personnel revealed that the sulfites containing product Golden Raisin 28Oz Pouch distributed in the packages that did not reveal the presence of sulfites.",
      "Consumers who have purchased 28-ounce pouch of Golden Raisin 28Oz Pouch are urged to return them to the place of purchase for a full refund.",
      "Consumers with questions may contact the company at 1 (201) 659-2200."
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/jalux-americas-inc-dba-jsweets-issues-allergy-alert-undeclared-tree-nuts-and-milk-lespoir-brand",
    "alert_date": "2025-07-17",
    "recalling_firm": "Jalux Americas, Inc.(dba J.sweets)",
    "brand_name": "L'espoir",
    "product_description": "L’espoir and Drycapot cookies,",
    "product_title": "Jalux Americas, Inc. (dba J.sweets) Issues Allergy Alert on Undeclared Tree Nuts and Milk in L’espoir Brand Cookies",
    "reason_for_recall": "Undeclared milk and tree nuts (almonds and macadamia nuts)",
    "affected_states": [
      "California",
      "Illinois",
      "Washington"
    ],
    "distribution_pattern": "The recalled products were distributed in California, Illinois and Washington and sold exclusively at J.sweets stores in Torrance, CA; San Jose, CA; Arlington Heights, IL;, and Lynnwood, WA. The L’espoir was sold at J.sweets stores between May 26 – June 30, 2025 and the Drycapot was sold at J.sweets stores between May 31 – June 30, 2025. There were no online sales of these products.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "July 14, 2025, Jalux Americas, Inc.(dba J.sweets) of El Segundo, CA is recalling 32 units of L’espoir Brand L’espoir cookies and 28 units of L’espoir Brand Drycapot cookies, because they may contain the following undeclared allergens: in L’espoir – undeclared milk; and in Drycapot – undeclared tree nuts (almond and macadamia nuts). People who have an allergy or severe sensitivity to milk and/or tree nuts (almond and macadamia nuts) run the risk of serious or life-threatening allergic reaction if they consume these products.",
      "The recalled products were distributed in California, Illinois and Washington and sold exclusively at J.sweets stores in Torrance, CA; San Jose, CA; Arlington Heights, IL;, and Lynnwood, WA. The L’espoir was sold at J.sweets stores between May 26 – June 30, 2025 and the Drycapot was sold at J.sweets stores between May 31 – June 30, 2025. There were no online sales of these products.",
      "Specific information on how the recalled cookies can be identified is as follows:",
      "No illnesses have been reported to date.",
      "The recall was initiated after it was discovered during an inventory audit that L’espoir product containing Milk and the Drycapot product containing Tree Nuts were inadvertently distributed in packaging that did not reveal the presence of those allergens.",
      "This recall is being made with the knowledge of the U.S. Food and Drug Administration.",
      "Consumers who have purchased L’espoir L4FN and Drycapot D4FN products with the best before date of 09/26/2025 are urged to return it to the place of purchase for a full refund. Consumers with questions may contact the company at 1-310-524-1078 from 09:00 to 17:00 Pacific Standard Time."
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/chetak-llc-group-recalls-product-because-possible-health-risk",
    "alert_date": "2025-07-16",
    "recalling_firm": "CHETAK  LLC GROUP",
    "brand_name": "Deep",
    "product_description": "Sprouted Moong (sprouted mung beans)",
    "product_title": "Chetak LLC Group Recalls Product Because of Possible Health Risk",
    "reason_for_recall": "Salmonella",
    "affected_states": [
      "Nationwide"
    ],
    "distribution_pattern": "The Recalled Sprouted Beans were distributed nationwide in retail stores under following Lot numbers",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Chetak New York LLC, Edison, NJ",
      "Chetak San Francisco LLC, Union City, CA",
      "Chetak Chicago LLC, Streamwood, IL",
      "Chetak Orlando LLC, Kissimmee, FL",
      "Chetak Los Angeles LLC, Pico Rivera, CA",
      "Zeenat Inc., Sugarland, TX",
      "Are recalling Frozen ‘Deep Sprouted Mat(Moth) 16 oz. and Deep Sprouted Moong 16oz. because they have the potential to be contaminated with Salmonella, an organism which can cause serious and sometimes fatal infection in young children, frail or elderly people and others with weakened immune system. Healthy persons infected with Salmonella often experience fever, diarrhea (which may be bloody), nausea, vomiting and abdominal pain. In rare circumstances, infection with Salmonella can result in the organism getting into the bloodstream and producing more severe illness such as arterial infections (i.e. infected aneurysms) endocarditis and arthritis",
      "The Recalled Sprouted Beans were distributed nationwide in retail stores under following Lot numbers",
      "No illness have been reported to date in connection with this problem to company",
      "The potential for contamination was noted after routine testing by FDA",
      "Production of the product has been suspended while FDA and the company continue their investigation as to the source of the problem.",
      "Consumers who have purchased 16 oz. packet of “Sprouted Mat (Moth) and Sprouted Moong” are urged to return them to place of purchase for a full refund. Consumers with questions may contact the Company at 908-209-8878.",
      "Link to CORE's Outbreak Advisory"
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/krasniy-oktyabr-inc-usa-issues-alert-eviscerate-dry-salted-vobla-aral-silver",
    "alert_date": "2025-07-15",
    "recalling_firm": "KRASNIY OKTYABR INC. USA",
    "brand_name": "ARAL SILVER VOBLA",
    "product_description": "EVISCERATE DRY SALTED VOBLA ARAL SILVER",
    "product_title": "Krasniy Oktyabr Inc. USA Issues Alert on Eviscerate Dry Salted Vobla “Aral Silver”",
    "reason_for_recall": "Potential Foodborne Illness – Clostridium botulinum",
    "affected_states": [
      "Nationwide"
    ],
    "distribution_pattern": "The fish were distributed nationwide through retail stores. The product comes in a clear plastic vacuum packaged bag with a blue label, containing two whole fish inside marked “Product of Kazakhstan”.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "KRASNIY OKTYABR INC. USA. of BROOKLYN, NY, is recalling its “ARAL SILVER VOBLA” brand “ARAL”, because the product was found to be uneviscerated.",
      "The fish were distributed nationwide through retail stores. The product comes in a clear plastic vacuum packaged bag with a blue label, containing two whole fish inside marked “Product of Kazakhstan”.",
      "The recall was initiated after routine sampling by New York State Department of Agriculture and Markets food inspectors and subsequent analysis by NYS Food Laboratory revealed the product was not properly eviscerated prior to processing.",
      "The sale of uneviscerated fish is prohibited because clostridium botulinum spores are more likely to be concentrated in the viscera than any other portion of the fish. Uneviscerated fish have been linked to outbreaks of botulism poisoning. Symptoms of botulism include dizziness, blurred or double vision and trouble with speaking or swallowing. Difficulty in breathing, weakness of other muscles, abdominal distension and constipation may also be common symptoms. People experiencing these problems should seek immediate medical attention.",
      "No illness has been reported to date in connection with this problem.",
      "Consumers who have purchased packages ‘DRY SALTED VOBLA ARAL SILVER’ are urged to return them to the place of purchase for a full refund. Consumers with questions may contact the company at 718-858-6720."
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/yocrunchr-products-voluntarily-recalled-danone-us-due-potential-presence-plastic-pieces-dome-topper",
    "alert_date": "2025-07-14",
    "recalling_firm": "Danone U.S.",
    "brand_name": "YoCrunch®",
    "product_description": "Yogurt with topper",
    "product_title": "YoCrunch® Products Voluntarily Recalled by Danone U.S. Due to Potential Presence of Plastic Pieces in Dome Topper",
    "reason_for_recall": "Potential presence of plastic pieces in the dome topper.",
    "affected_states": [
      "Nationwide"
    ],
    "distribution_pattern": "WHITE PLAINS, N.Y. and LOUISVILLE, Colo, July 14, 2025 – Danone U.S. is voluntarily recalling YoCrunch® products sold at retail stores nationwide due to the potential presence of plastic pieces in the dome topper. If consumed, the plastic pieces could potentially cause a choking response. The issue is isolated only to the separately packaged topper and does not impact the separately packaged yogurt. This recall applies to all flavors and sizes of YoCrunch® products currently inmarket, as summarized on the table below.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "WHITE PLAINS, N.Y. and LOUISVILLE, Colo, July 14, 2025 – Danone U.S. is voluntarily recalling YoCrunch® products sold at retail stores nationwide due to the potential presence of plastic pieces in the dome topper. If consumed, the plastic pieces could potentially cause a choking response. The issue is isolated only to the separately packaged topper and does not impact the separately packaged yogurt. This recall applies to all flavors and sizes of YoCrunch® products currently inmarket, as summarized on the table below.",
      "Consumer complaints have reported the presence of plastic pieces in the toppers, which have the potential to cause choking. The plastic pieces are transparent, may have sharp edges, and could present a risk to consumers because some pieces are between 7 and 25 mm in length. This voluntary recall was initiated on July 11, 2025, and is being conducted in cooperation with the U.S. Food and Drug Administration (FDA). The company is working swiftly with retail partners to remove the impacted product from shelves, while it works to address the issue and bring back the YoCrunch® products so many people enjoy.",
      "Danone U.S., the makers of YoCrunch, takes every consumer experience seriously and is initiating this voluntary recall in line with its commitment to product quality and consumer safety.",
      "Consumers who have purchased the affected YoCrunch® products should not consume them. For information on refunds, please contact the YoCrunch® Consumer Care Line at 1-877-344-4886. Consumer Care specialists are available to speak live Monday - Friday, 9am to 6pm ET.",
      "Packages / containers will appear like this: See Images Below",
      "Impacted product names and code dates are below.",
      "LOT #/EXP DATE",
      "YOCRUNCH STRAW W/GRANOLA 6OZ(UPC 46675000105)",
      "2025.07.07, 2025.07.12, 2025.07.26, 2025.08.03, 2025.08.08, 2025.08.19,2025.08.22, 2025.08.30, 2025.09.04",
      "YOCRUNCH VANILLA W/M&M 6OZ(UPC 46675000792)",
      "2025.07.11, 2025.07.14, 2025.07.25, 2025.08.07, 2025.08.11, 2025.08.22, 2025.08.26, 2025.09.03",
      "YOCRUNCH VANILLA W/OREO 6OZ (UPC 46675000808)",
      "2025.07.11, 2025.07.14, 2025.07.24, 2025.07.25 2025.08.06, 2025.08.11, 2025.08.21, 2025.08.26, 2025.09.03",
      "YOCRUNCH STRAW W/M&M 6OZ (UPC 46675000839)",
      "2025.07.12, 2025.07.25, 2025.08.07, 2025.08.22, 2025.09.04",
      "YOCRUNCH VANILLA W/SNICKERS 6OZ (UPC 46675001126)",
      "2025.07.10, 2025.07.24, 2025.08.06, 2025.08.21",
      "YOCRUNCH VANILLA W/TWIX CANDY 6OZ (UPC 46675001133)",
      "2025.07.24, 2025.08.07, 2025.08.21",
      "YOCRUNCH STRAW W/M&M MULTI 4X4OZ (UPC 46675013129)",
      "2025.07.08, 2025.07.12, 2025.07.13, 2025.07.17, 2025.07.18, 2025.07.26, 2025.07.27, 2025.08.02, 2025.08.03, 2025.08.09, 2025.08.11, 2025.08.12, 2025.08.13, 2025.08.15, 2025.08.16, 2025.08.23, 2025.08.24, 2025.08.29, 2025.08.30, 2025.08.31",
      "YOCRUNCH VAN W/COOKIE DOUGH 4X4OZ (UPC 46675013150)",
      "2025.07.17, 2025.08.01, 2025.08.13, 2025.08.29",
      "YOCRUNCH VANI W/SNICKER PCS 4X4OZ (UPC 46675013266)",
      "2025.07.17, 2025.08.01, 2025.08.13, 2025.09.01",
      "YOCRUNCH VANI W/TWIX CANDY 4X4OZ (UPC 46675013273)",
      "2025.07.17, 2025.08.01, 2025.08.14, 2025.08.29",
      "YOCRUNCH VANILLA OREO 4X4OZ(UPC 46675013501)",
      "2025.07.13, 2025.07.14, 2025.07.20, 2025.07.21, 2025.07.24, 2025.07.25, 2025.07.26, 2025.07.31, 2025.08.01, 2025.08.02, 2025.08.08, 2025.08.09, 2025.08.10, 2025.08.11, 2025.08.15, 2025.08.16, 2025.08.23, 2025.08.24, 2025.08.25, 2025.08.30, 2025.08.31",
      "YOCRUNCH VANILLA M&M 4X4OZ (UPC 46675013518)",
      "2025.07.07, 2025.07.09, 2025.07.14, 2025.07.15, 2025.07.16, 2025.07.17, 2025.07.22, 2025.07.23, 2025.07.26, 2025.07.27, 2025.07.28, 2025.08.02, 2025.08.03, 2025.08.05, 2025.08.06, 2025.08.07, 2025.08.10, 2025.08.13, 2025.08.14, 2025.08.16, 2025.08.17,2025.08.18, 2025.08.19, 2025.08.20, 2025.08.21, 2025.08.22, 2025.08.26, 2025.08.27, 2025.08.28, 2025.08.29, 2025.09.01, 2025.09.02, 2025.09.03, 2025.09.04",
      "YOCRUNCH VAN OREO & M&M FR PK 8X6OZ(UPC 46675014003)",
      "2025.07.12, 2025.07.13, 2025.07.14, 2025.07.15, 2025.07.16, 2025.07.20, 2025.07.21, 2025.07.22, 2025.07.23, 2025.07.24, 2025.07.25, 2025.07.28, 2025.08.02, 2025.08.03, 2025.08.04, 2025.08.05, 2025.08.06, 2025.08.07, 2025.08.10, 2025.08.11, 2025.08.12, 2025.08.13, 2025.08.14, 2025.08.17,2025.08.18, 2025.08.19, 2025.08.20, 2025.08.21, 2025.08.22, 2025.08.23, 2025.08.25, 2025.08.26, 2025.08.27, 2025.08.28, 2025.08.29, 2025.09.02",
      "YOCRUNCH STR/RAS GRNLA FR PK 8X6OZ (UPC 46675014010)",
      "2025.07.26, 2025.08.23, 2025.08.30",
      "YOCRUNCH STRW W/M&M&OREO FR PK 8X6OZ (UPC 46675026136)",
      "2025.07.22, 2025.08.03, 2025.08.19, 2025.08.29",
      "YOCRUNCH VAN W/SNIC&TWIX FR PK 8X6OZ (UPC 46675026143)",
      "2025.07.14, 2025.07.28, 2025.08.11, 2025.08.26",
      "YOCRUNCH VAN OREO/VAN M&M 18X6OZ CLB (UPC 46675027010)",
      "2025.07.11, 2025.07.19, 2025.07.20,2025.07.26, 2025.07.27, 2025.07.28, 2025.07.31, 2025.08.01, 2025.08.02, 2025.08.08, 2025.08.09, 2025.08.16, 2025.08.17, 2025.08.23, 2025.08.24, 2025.08.25, 2025.08.30, 2025.08.31",
      "Company Contact Information Consumers:YoCrunch® Consumer Care Line 1-877-344-4886",
      "Media:Karissa SeltzUs.media@danone.com"
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/updated-release-hartford-bakery-inc-issues-allergy-alert-undeclared-hazelnuts-lewis-bake-shop",
    "alert_date": "2025-07-14",
    "recalling_firm": "Hartford Bakery, Inc.",
    "brand_name": "Lewis Bake Shop",
    "product_description": "Artisan Style 1/2 Loaf",
    "product_title": "Updated Release: Hartford Bakery, Inc. Issues Allergy Alert on Undeclared Hazelnuts in “Lewis Bake Shop Artisan Style ½ Loaf”",
    "reason_for_recall": "Undeclared hazelnuts",
    "affected_states": [
      "Alabama",
      "Arkansas",
      "Georgia",
      "Illinois",
      "Indiana",
      "Kentucky",
      "Michigan",
      "Mississippi",
      "Missouri",
      "Ohio",
      "Tennessee",
      "Wisconsin"
    ],
    "distribution_pattern": "The recalled “Lewis Bake Shop Artisan Style 1/2 Loaf” products were distributed in Michigan, Wisconsin, Illinois, Indiana, Ohio, Kentucky, Tennessee, Georgia, Arkansas, Missouri, Alabama, and Mississippi retailers, including Kroger and Walmart. The product comes in a flexible plastic bag marked with the following information:",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "EVANSVILLE, IN – July 11, 2025 -- Hartford Bakery, Inc. is voluntarily recalling six lots of its “Lewis Bake Shop Artisan Style 1/2 Loaf” as this product may contain undeclared hazelnuts. People with a nut allergy or severe sensitivity to hazelnuts run the risk of serious or life-threatening allergic reactions if they consume these products.",
      "Out of an abundance of caution, Hartford Bakery, Inc. is removing all units of product included in the twelve effected lot codes noted below. Hartford Bakery, Inc has determined that no other lot codes were affected.",
      "The recalled “Lewis Bake Shop Artisan Style 1/2 Loaf” products were distributed in Michigan, Wisconsin, Illinois, Indiana, Ohio, Kentucky, Tennessee, Georgia, Arkansas, Missouri, Alabama, and Mississippi retailers, including Kroger and Walmart. The product comes in a flexible plastic bag marked with the following information:",
      "The recall was initiated after discovering that approximately 883 loaves of bread from six production lots contained visible hazelnuts and were distributed in “Lewis Bake Shop Artisan Style 1/2 Loaf” packaging. While the packaging states “May Contain Tree Nuts,” it does not state that it “Contains Hazelnuts.” An investigation revealed an error in change of packaging for a hazelnut-containing bread to the implicated white bread product.",
      "While there have been no major reports of injury or illness to date, Hartford Bakery is aware of one customer who experienced digestive discomfort after consumption. Hartford Bakery also received consumer complaints from those who saw the nuts before consuming the product.",
      "Consumers who purchased the implicated products are urged to return them to the place of purchase for a full refund. Consumers with questions may contact Hartford Bakery at 1-812-425-4642 Monday through Friday, except for holidays, from 8:00am-3:00pm CST.",
      "ContactsTracy Wingo1-812-425-4642",
      "*This updated release corrects the previously reported lot codes.",
      "Link to Original Press Release"
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/world-market-recalls-emek-spread-pistachio-cacao-cream-kadayif-due-salmonella-contamination",
    "alert_date": "2025-07-14",
    "recalling_firm": "World Market",
    "brand_name": "Emek",
    "product_description": "Spread Pistachio Cacao Cream with Kadayif",
    "product_title": "World Market Recalls Emek Spread Pistachio Cacao Cream with Kadayif Due to Salmonella Contamination",
    "reason_for_recall": "Salmonella",
    "affected_states": [
      "Alabama",
      "Arizona",
      "California",
      "Colorado",
      "Connecticut",
      "Florida",
      "Georgia",
      "Illinois",
      "Indiana",
      "Iowa",
      "Kansas",
      "Kentucky",
      "Louisiana",
      "Maryland",
      "Massachusetts",
      "Michigan",
      "Minnesota",
      "Missouri",
      "Nebraska",
      "New Hampshire",
      "New Jersey",
      "North Carolina",
      "Ohio",
      "Oklahoma",
      "Pennsylvania",
      "South Carolina",
      "South Dakota",
      "Tennessee",
      "Texas",
      "Virginia",
      "Washington",
      "Wisconsin"
    ],
    "distribution_pattern": "The products were distributed between June 11 to July 9, 2025. The product is packaged in clear glass jar with the date code etched on the top of the lid. The product is sold primarily in World Market retail stores located in the States of: AL, AZ, CA, CO, CT, FL, GA, IA, IL, IN, KS, KY, LA, MA, MD, MI, MN, MO, NC, NE, NH, NJ, OH, OK, PA, SC, SD, TN, TX, VA, WA & WI.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "Alameda, CA, July 14, 2025 – World Market is recalling EMEK SPREAD PISTACHIO CACAO CREAM WITH KADAYIF, 9.7oz, Best Before: April 01, 2027, Batch Number: 250401 due to a potential contamination of Salmonella.",
      "Salmonella is an organism which can cause serious and sometimes fatal infections in young children, frail or elderly people, and others with weakened immune systems. Healthy persons infected with Salmonella often experience fever, diarrhea (which may be bloody), nausea, vomiting and abdominal pain. In rare circumstances, infection with Salmonella can result in the organism getting into the bloodstream and producing more severe illnesses such as arterial infections (i.e., infected aneurysms), endocarditis and arthritis.",
      "The firm initiated the recall after samples of the product were tested by the FDA and the products tested positive for Salmonella.",
      "No illnesses have been reported to date.",
      "See attached photos for ease of identifying the product. Products affected are:",
      "LOT/MFG CODES",
      "USE BY DATE",
      "Emek Spread Pistachio Cacao Cream with Kadayif",
      "BATCH NO: 250401",
      "8 69652 10130 1",
      "BEST BEFOREAPRIL 01 2027",
      "The products were distributed between June 11 to July 9, 2025. The product is packaged in clear glass jar with the date code etched on the top of the lid. The product is sold primarily in World Market retail stores located in the States of: AL, AZ, CA, CO, CT, FL, GA, IA, IL, IN, KS, KY, LA, MA, MD, MI, MN, MO, NC, NE, NH, NJ, OH, OK, PA, SC, SD, TN, TX, VA, WA & WI.",
      "Consumers who have purchased these products are urged not to consume them and return them to the place of purchase for a full refund or they may discard the product. Consumers with questions may contact Customer Service at 877.967.5362 Sunday – Saturday 7:00 am – 12:00 am EST.",
      "This recall is being made with the knowledge of the Food and Drug Administration."
    ]
  },
  {
    "alert_url": "https://www.fda.gov/safety/recalls-market-withdrawals-safety-alerts/llk-trading-inc-recalls-needle-mushrooms-because-possible-health-risk",
    "alert_date": "2025-07-13",
    "recalling_firm": "LLK TRADING INC.",
    "brand_name": "LLK TRADING INC.",
    "product_description": "Needle mushroom",
    "product_title": "LLK Trading Inc. Recalls “Needle Mushrooms” Because of Possible Health Risk",
    "reason_for_recall": "Potential Foodborne Illness – Listeria monocytogenes",
    "affected_states": [
      "Nationwide"
    ],
    "distribution_pattern": "LLK TRADING INC. of Linden, NJ, is recalling its 200g packages of “Needle Mushrooms” because it has the potential to be contaminated with Listeria monocytogenes, an organism which can cause serious and sometimes fatal infections in young children, frail or elderly people, and others with weakened immune systems. Although healthy individuals may suffer only short-term symptoms such as high fever, severe headache, stiffness, nausea, abdominal pain and diarrhea, Listeria infection can cause miscarriages and stillbirths among pregnant women. The recalled “Needle Mushrooms” were distributed to Bally Produce Corp. located at 4900 Maspeth Ave, Maspeth, NY 11378, and was sold to DATANG SUPERMARKET INC.",
    "press_release_paragraphs": [
      "COMPANY ANNOUNCEMENT",
      "When a company announces a recall, market withdrawal, or safety alert, the FDA posts the company's announcement as a public service. FDA does not endorse either the product or the company.",
      "More Recalls, Market \n    Withdrawals, & \n    Safety Alerts",
      "LLK TRADING INC. of Linden, NJ, is recalling its 200g packages of “Needle Mushrooms” because it has the potential to be contaminated with Listeria monocytogenes, an organism which can cause serious and sometimes fatal infections in young children, frail or elderly people, and others with weakened immune systems. Although healthy individuals may suffer only short-term symptoms such as high fever, severe headache, stiffness, nausea, abdominal pain and diarrhea, Listeria infection can cause miscarriages and stillbirths among pregnant women. The recalled “Needle Mushrooms” were distributed to Bally Produce Corp. located at 4900 Maspeth Ave, Maspeth, NY 11378, and was sold to DATANG SUPERMARKET INC.",
      "The product comes in a 200 gram, clear plastic packaging on the top and blue (non-transparent) on the bottom.",
      "No illnesses have been reported to date in connection with this problem.",
      "The potential for contamination was noted after routine testing by the FDA revealed the presence of Listeria monocytogenes in the package they sampled.",
      "Vending of the product has been suspended while FDA and the company continues their investigation as to the source of the contamination.",
      "Consumers who have purchased the 200 gram packages of “Needle Mushrooms” are urged not to consume the products and to return them to the place of purchase for a full refund. Consumers with questions may contact the company Monday to Friday 9:30am to 3:00pm (EST) at (908)-290-3061."
    ]
  }
]